
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаГлобальныеКоманды);
	// Конец СтандартныеПодсистемы.Печать

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СкладВнутреннихПотребленийПриИзменении(Элемент)
	СкладПриИзмененииСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.СписокДокументы);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СкладПриИзмененииСервер()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	СписокДокументы,
	"Склад",
	Склад,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	ЗначениеЗаполнено(Склад));
	
КонецПроцедуры
#КонецОбласти