&НаКлиенте
Перем ВыполняетсяЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ЗаполнитьПредустановленныеОписания();
	
	ЗагрузитьНастройки();
	
	УстановитьВидимостьИДоступность();
	
	УстановитьВидимостьСтраниц(Элементы.СтраницаОсновныеНастройки.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСтраницыИОписания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьСтатусыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Или ИмяСобытия = "Запись_Склады" Тогда
			УстановитьВидимостьИДоступность();
			УстановитьСтраницыИОписания();
	КонецЕсли;
		
	Если ИмяСобытия = "Запись_МножествоВидовНоменклатуры" Тогда
			УстановитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиНаГлавнуюСтраницу(Команда)
	
	УстановитьВидимостьСтраниц(Элементы.СтраницаОсновныеНастройки.Имя);
	
	Заголовок = НСтр("ru = 'Помощник заполнения настроек и справочников'");
	
	Элементы.КоманднаяПанель.ТекущаяСтраница = Элементы.КоманднаяПанель.ПодчиненныеЭлементы.СтраницаКоманднаяПанельОсновная;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	МассивРеквизитов = МассивРеквизитовФормы(Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя);
	
	Для Каждого Реквизит из МассивРеквизитов Цикл
		ЭтаФорма[Реквизит] = Ложь;
	КонецЦикла;
	
	УстановитьСтраницыИОписания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Установка страниц.

&НаКлиенте 
Процедура УстановитьСтраницыИОписания()
	
	// Страница основные настройки.
	
	УстановитьСтраницуОрганизации();
	УстановитьСтраницуСтруктураПредприятия();
	УстановитьСтраницуГрафикиРаботы();
	УстановитьСтраницуНастройкиПользователейИПрав();
	УстановитьСтраницуГруппыДоступа();
	УстановитьСтраницуВводНачальныхДанных();
	УстановитьСтраницуНастройкаПараметровПодсистемыТОиР();

	// Страница настройки учета оборудования и нормативов.
	
	УстановитьСтраницуГруппаОборудованиеИНормативы();
	УстановитьСтраницуТехнологическиеОперации();
	УстановитьСтраницуТехнологическиеКарты();
	УстановитьСтраницуНаправленияОР();
	УстановитьСтраницуВидыРемонтов();
	УстановитьСтраницуСпособыПланированияРемонтныхРабот();
	УстановитьСтраницуСтруктураИерархииОР();
	УстановитьСтраницуОбъектыРемонта();
	УстановитьСтраницуТиповыеОР();
	УстановитьСтраницуСпискиОбъектовРегламентныхМероприятий();
	
	// Страница настройки учета показателей эксплуатации
	
	УстановитьСтраницуГруппаПоказателиЭксплуатации();
	УстановитьСтраницуИзмеряемыеПоказатели();
	УстановитьСтраницуПараметрыНаработки();
	УстановитьСтраницуУсловияВыявленияДефеков();
	УстановитьСтраницуВидыДефектов();
	УстановитьСтраницуПричиныДефектов();
	УстановитьСтраницуКритичностьДефектов();
	УстановитьСтраницуТиповыеДефектыОборудования();
	УстановитьСтраницуВидыЭксплуатации();
	
КонецПроцедуры

// Прочие.

&НаКлиентеНаСервереБезКонтекста
Функция МассивРеквизитовФормы(ИмяСтраницы = Неопределено)
	
	Массив = Новый Массив;
	
	// Страница основные настройки.
	
	Если ИмяСтраницы = Неопределено Или ИмяСтраницы = "СтраницаОсновныеНастройки" Тогда
		
		Массив.Добавить("ОтметкаОрганизации");
		Массив.Добавить("ОтметкаСтруктураПредприятия");
		Массив.Добавить("ОтметкаГрафикиРаботы");
		Массив.Добавить("ОтметкаНастройкиПользователейИПрав");
		Массив.Добавить("ОтметкаГруппыДоступа");
		Массив.Добавить("ОтметкаВводНачальныхДанных");
		Массив.Добавить("ОтметкаГруппаОборудованиеИНормативы");
		Массив.Добавить("ОтметкаГруппаПоказателиЭксплуатации");
		Массив.Добавить("ОтметкаНастройкаПараметровПодсистемыТОиР");
		
	КонецЕсли;
	
	// Страница настройки оборудования и нормативов.
	
	Если ИмяСтраницы = Неопределено Или ИмяСтраницы = "СтраницаОсновныеНастройкиОборудованияИНормативов" Тогда
		
		Массив.Добавить("ОтметкаТехнологическиеОперации");
		Массив.Добавить("ОтметкаТехнологическиеКарты");
		Массив.Добавить("ОтметкаНаправления");
		
		Массив.Добавить("ОтметкаВидыРемонтов");
		Массив.Добавить("ОтметкаСпособыПланированияРемонтныхРабот");
		
		Массив.Добавить("ОтметкаСпискиОбъектовРегламентныхМероприятий");
		Массив.Добавить("ОтметкаСтруктураИерархииОР");
		Массив.Добавить("ОтметкаОбъектыРемонта");
		Массив.Добавить("ОтметкаТиповыеОР");
		
	КонецЕсли;
	
	// Страница настройки показателей эксплуатации
	
	Если ИмяСтраницы = Неопределено Или ИмяСтраницы = "СтраницаОсновныеНастройкиПоказателейЭксплуатации" Тогда
		
		Массив.Добавить("ОтметкаИзмеряемыеПоказатели");
		Массив.Добавить("ОтметкаПараметрыНаработки");
		Массив.Добавить("ОтметкаВидыДефектов");
		Массив.Добавить("ОтметкаПричиныДефектов");
		Массив.Добавить("ОтметкаКритичностьДефектов");
		Массив.Добавить("ОтметкаТиповыеДефектыОборудования");
		
		Массив.Добавить("ОтметкаУсловияВыявленияДефектов");
		Массив.Добавить("ОтметкаВидыЭксплуатации");
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредустановленныеОписания()
	
	// Страница основные настройки.
	
	ОписаниеГруппаНоменклатура			= НСтр("ru = 'Настройки учета номенклатуры должны выполняться с учетом особенностей всех подсистем.'");
	ОписаниеГруппаЗапасыИЗакупки		= НСтр("ru = 'Задание параметров позволит управлять закупками и доставкой, складскими запасами и автоматизировать операции складского учета.'");
	ОписаниеГруппаМаркетингИПродажи		= НСтр("ru = 'Задание параметров позволит планировать маркетинговые мероприятия и анализировать рынок, управлять процессами продаж, включая ценообразование и взаиморасчеты с клиентами.'");
	ОписаниеГруппаПроизводство			= НСтр("ru = 'Задание параметров позволит планировать и контролировать выполнение производственных операций, формировать первичные документы производственного учета, а так же рассчитывать потребности в ресурсах.'");
	ОписаниеГруппаРемонты				= НСтр("ru = 'Задание параметров позволит планировать и контролировать выполнение ремонтно-профилактических работ, а так же рассчитывать потребности в материальных и трудовых ресурсах на их выполнение.'");
	
	ПредустановленныеОписания.Добавить("ГруппаНоменклатура", ОписаниеГруппаНоменклатура);
	ПредустановленныеОписания.Добавить("ГруппаЗапасыИЗакупки", ОписаниеГруппаЗапасыИЗакупки);
	ПредустановленныеОписания.Добавить("ГруппаМаркетингИПродажи", ОписаниеГруппаМаркетингИПродажи);
	ПредустановленныеОписания.Добавить("ГруппаПроизводство", ОписаниеГруппаПроизводство);
	ПредустановленныеОписания.Добавить("ГруппаРемонты", ОписаниеГруппаРемонты);
	
	Для Каждого Элемент Из ПредустановленныеОписания Цикл
		Элемент.Представление = СтрЗаменить(Элемент.Представление, символы.ПС, "");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраниц(ИмяСтраницы)
	
	НоваяСтраница = Элементы[ИмяСтраницы];
	
	НоваяСтраница.Видимость = Истина;
	Элементы.ОсновнаяПанель.ТекущаяСтраница = НоваяСтраница;
	
	Для Каждого Элемент Из Элементы.ОсновнаяПанель.ПодчиненныеЭлементы Цикл
		Если Элемент = НоваяСтраница Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрафикиРаботы(Команда)
	
	ОткрытьФорму("Справочник.Календари.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыЭксплуатации(Команда)
	ОткрытьФорму("Справочник.торо_ВидыЭксплуатации.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиПользователейИПрав(Команда)
	
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиПользователейИПрав", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаОрганизацииНажатие(Элемент)
	
	ОтметкаОрганизации = Не ОтметкаОрганизации;
	
	УстановитьСтраницуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСтруктураПредприятияНажатие(Элемент)
	
	ОтметкаСтруктураПредприятия = Не ОтметкаСтруктураПредприятия;
	
	УстановитьСтраницуСтруктураПредприятия();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаГрафикиРаботыНажатие(Элемент)
	
	ОтметкаГрафикиРаботы = Не ОтметкаГрафикиРаботы;
	
	УстановитьСтраницуГрафикиРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаНастройкиПользователейИПравНажатие(Элемент)
	
	ОтметкаНастройкиПользователейИПрав = Не ОтметкаНастройкиПользователейИПрав;
	
	УстановитьСтраницуНастройкиПользователейИПрав();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаНаправленияНажатие(Элемент)
	
	ОтметкаНаправления = Не ОтметкаНаправления;
	
	УстановитьСтраницуНаправленияОР();

КонецПроцедуры

&НаКлиенте
Процедура ОтметкаВидыРемонтовНажатие(Элемент)
	
	ОтметкаВидыРемонтов = Не ОтметкаВидыРемонтов;
	
	УстановитьСтраницуВидыРемонтов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаТехнологическиеОперацииНажатие(Элемент)
	
	ОтметкаТехнологическиеОперации = Не ОтметкаТехнологическиеОперации;
	
	УстановитьСтраницуТехнологическиеОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаТехнологическиеКартыНажатие(Элемент)
	
	ОтметкаТехнологическиеКарты = Не ОтметкаТехнологическиеКарты;
	
	УстановитьСтраницуТехнологическиеКарты();
	
КонецПроцедуры

&НаКлиенте
Процедура СпискиОбъектовРегламентныхМероприятийОтметкаНажатие(Элемент)
	
	ОтметкаСпискиОбъектовРегламентныхМероприятий = Не ОтметкаСпискиОбъектовРегламентныхМероприятий;
	УстановитьСтраницуСпискиОбъектовРегламентныхМероприятий();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСпособыПланированияРемонтныхРаботНажатие(Элемент)
	
	ОтметкаСпособыПланированияРемонтныхРабот = Не ОтметкаСпособыПланированияРемонтныхРабот;
	
	УстановитьСтраницуСпособыПланированияРемонтныхРабот();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСтруктураИерархииОРНажатие(Элемент)
	
	ОтметкаСтруктураИерархииОР = Не ОтметкаСтруктураИерархииОР;
	
	УстановитьСтраницуСтруктураИерархииОР();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаОбъектыРемонтаНажатие(Элемент)
	
	ОтметкаОбъектыРемонта = Не ОтметкаОбъектыРемонта;
	
	УстановитьСтраницуОбъектыРемонта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаТиповыеОРНажатие(Элемент)
	
	ОтметкаТиповыеОР = Не ОтметкаТиповыеОР;
	
	УстановитьСтраницуТиповыеОР();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаИзмеряемыеПоказателиНажатие(Элемент)
	
	ОтметкаИзмеряемыеПоказатели = Не ОтметкаИзмеряемыеПоказатели;
	
	УстановитьСтраницуИзмеряемыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаПараметрыНаработкиНажатие(Элемент)
	
	ОтметкаПараметрыНаработки = Не ОтметкаПараметрыНаработки;
	
	УстановитьСтраницуПараметрыНаработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаУсловияВыявленияДефековНажатие(Элемент)
	
	ОтметкаУсловияВыявленияДефектов = Не ОтметкаУсловияВыявленияДефектов;
	
	УстановитьСтраницуУсловияВыявленияДефеков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаВидыДефектовНажатие(Элемент)
	
	ОтметкаВидыДефектов = Не ОтметкаВидыДефектов;
	
	УстановитьСтраницуВидыДефектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаПричиныДефектовНажатие(Элемент)
	
	ОтметкаПричиныДефектов = Не ОтметкаПричиныДефектов;
	
	УстановитьСтраницуПричиныДефектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаКритичностьДефектовНажатие(Элемент)
	
	ОтметкаКритичностьДефектов = Не ОтметкаКритичностьДефектов;
	
	УстановитьСтраницуКритичностьДефектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаТиповыеДефектыОборудованияНажатие(Элемент)
	
	ОтметкаТиповыеДефектыОборудования = Не ОтметкаТиповыеДефектыОборудования;
	
	УстановитьСтраницуТиповыеДефектыОборудования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаВидыЭксплуатацииНажатие(Элемент)
	
	ОтметкаВидыЭксплуатации = Не ОтметкаВидыЭксплуатации;
	
	УстановитьСтраницуВидыЭксплуатации();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуОрганизации()
	
	Если ОтметкаОрганизации Тогда 
		Элементы.ОрганизацииСтраницы.ТекущаяСтраница = Элементы.ОрганизацииСтраницы.ПодчиненныеЭлементы.СтраницаОрганизацииОтменить;
	Иначе
		Элементы.ОрганизацииСтраницы.ТекущаяСтраница = Элементы.ОрганизацииСтраницы.ПодчиненныеЭлементы.СтраницаОрганизацииГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуСтруктураПредприятия()
	
	Если ОтметкаСтруктураПредприятия Тогда 
		Элементы.СтруктураПредприятияСтраницы.ТекущаяСтраница = Элементы.СтруктураПредприятияСтраницы.ПодчиненныеЭлементы.СтраницаСтруктураПредприятияОтменить;
	Иначе
		Элементы.СтруктураПредприятияСтраницы.ТекущаяСтраница = Элементы.СтруктураПредприятияСтраницы.ПодчиненныеЭлементы.СтраницаСтруктураПредприятияГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуГрафикиРаботы()
	
	Если ОтметкаГрафикиРаботы Тогда
		Элементы.ГрафикиРаботыСтраницы.ТекущаяСтраница = Элементы.ГрафикиРаботыСтраницы.ПодчиненныеЭлементы.СтраницаГрафикиРаботыОтменить;
	Иначе
		Элементы.ГрафикиРаботыСтраницы.ТекущаяСтраница = Элементы.ГрафикиРаботыСтраницы.ПодчиненныеЭлементы.СтраницаГрафикиРаботыГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуНастройкиПользователейИПрав()
	
	Если ОтметкаНастройкиПользователейИПрав Тогда
		Элементы.НастройкиПользователейИПравСтраницы.ТекущаяСтраница = Элементы.НастройкиПользователейИПравСтраницы.ПодчиненныеЭлементы.СтраницаНастройкиПользователейИПравОтменить;
	Иначе
		Элементы.НастройкиПользователейИПравСтраницы.ТекущаяСтраница = Элементы.НастройкиПользователейИПравСтраницы.ПодчиненныеЭлементы.СтраницаНастройкиПользователейИПравГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуНаправленияОР()
	
	Если ОтметкаНаправления Тогда 
		Элементы.НаправленияСтраницы.ТекущаяСтраница = Элементы.НаправленияСтраницы.ПодчиненныеЭлементы.СтраницаНаправленияОтменить;
	Иначе
		Элементы.НаправленияСтраницы.ТекущаяСтраница = Элементы.НаправленияСтраницы.ПодчиненныеЭлементы.СтраницаНаправленияГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуВидыРемонтов()
	
	Если ОтметкаВидыРемонтов Тогда 
		Элементы.ВидыРемонтовСтраницы.ТекущаяСтраница = Элементы.ВидыРемонтовСтраницы.ПодчиненныеЭлементы.СтраницаВидыРемонтовОтменить;
	Иначе
		Элементы.ВидыРемонтовСтраницы.ТекущаяСтраница = Элементы.ВидыРемонтовСтраницы.ПодчиненныеЭлементы.СтраницаВидыРемонтовГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуТехнологическиеОперации()
	
	Если ОтметкаТехнологическиеОперации Тогда 
		Элементы.ТехнологическиеОперацииСтраницы.ТекущаяСтраница = Элементы.ТехнологическиеОперацииСтраницы.ПодчиненныеЭлементы.СтраницаТехнологическиеОперацииОтменить;
	Иначе
		Элементы.ТехнологическиеОперацииСтраницы.ТекущаяСтраница = Элементы.ТехнологическиеОперацииСтраницы.ПодчиненныеЭлементы.СтраницаТехнологическиеОперацииГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуТехнологическиеКарты()
	
	Если ОтметкаТехнологическиеКарты Тогда 
		Элементы.ТехнологическиеКартыСтраницы.ТекущаяСтраница = Элементы.ТехнологическиеКартыСтраницы.ПодчиненныеЭлементы.СтраницаТехнологическиеКартыОтменить;
	Иначе
		Элементы.ТехнологическиеКартыСтраницы.ТекущаяСтраница = Элементы.ТехнологическиеКартыСтраницы.ПодчиненныеЭлементы.СтраницаТехнологическиеКартыГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуСпискиОбъектовРегламентныхМероприятий()
	
	Если ОтметкаСпискиОбъектовРегламентныхМероприятий Тогда 
		Элементы.СпискиОбъектовРегламентныхМероприятийСтраницы.ТекущаяСтраница = Элементы.СпискиОбъектовРегламентныхМероприятийСтраницы.ПодчиненныеЭлементы.СтраницаСпискиОбъектовРегламентныхМероприятийОтменить;
	Иначе
		Элементы.СпискиОбъектовРегламентныхМероприятийСтраницы.ТекущаяСтраница = Элементы.СпискиОбъектовРегламентныхМероприятийСтраницы.ПодчиненныеЭлементы.СтраницаСпискиОбъектовРегламентныхМероприятийГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуСпособыПланированияРемонтныхРабот()
	
	Если ОтметкаСпособыПланированияРемонтныхРабот Тогда 
		Элементы.СпособыПланированияРемонтныхРаботСтраницы.ТекущаяСтраница = Элементы.СпособыПланированияРемонтныхРаботСтраницы.ПодчиненныеЭлементы.СтраницаСпособыПланированияРемонтныхРаботОтменить;
	Иначе
		Элементы.СпособыПланированияРемонтныхРаботСтраницы.ТекущаяСтраница = Элементы.СпособыПланированияРемонтныхРаботСтраницы.ПодчиненныеЭлементы.СтраницаСпособыПланированияРемонтныхРаботГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуСтруктураИерархииОР()
	
	Если ОтметкаСтруктураИерархииОР Тогда 
		Элементы.СтруктураИерархииОРСтраницы.ТекущаяСтраница = Элементы.СтруктураИерархииОРСтраницы.ПодчиненныеЭлементы.СтраницаСтруктураИерархииОРОтменить;
	Иначе
		Элементы.СтруктураИерархииОРСтраницы.ТекущаяСтраница = Элементы.СтруктураИерархииОРСтраницы.ПодчиненныеЭлементы.СтраницаСтруктураИерархииОРГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуОбъектыРемонта()
	
	Если ОтметкаОбъектыРемонта Тогда 
		Элементы.ОбъектыРемонтаСтраницы.ТекущаяСтраница = Элементы.ОбъектыРемонтаСтраницы.ПодчиненныеЭлементы.СтраницаОбъектыРемонтаОтменить;
	Иначе
		Элементы.ОбъектыРемонтаСтраницы.ТекущаяСтраница = Элементы.ОбъектыРемонтаСтраницы.ПодчиненныеЭлементы.СтраницаОбъектыРемонтаГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуТиповыеОР()
	
	Если ОтметкаТиповыеОР Тогда 
		Элементы.ТиповыеОРСтраницы.ТекущаяСтраница = Элементы.ТиповыеОРСтраницы.ПодчиненныеЭлементы.СтраницаТиповыеОРОтменить;
	Иначе
		Элементы.ТиповыеОРСтраницы.ТекущаяСтраница = Элементы.ТиповыеОРСтраницы.ПодчиненныеЭлементы.СтраницаТиповыеОРГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуИзмеряемыеПоказатели()
	
	Если ОтметкаИзмеряемыеПоказатели Тогда 
		Элементы.ИзмеряемыеПоказателиСтраницы.ТекущаяСтраница = Элементы.ИзмеряемыеПоказателиСтраницы.ПодчиненныеЭлементы.СтраницаИзмеряемыеПоказателиОтменить;
	Иначе
		Элементы.ИзмеряемыеПоказателиСтраницы.ТекущаяСтраница = Элементы.ИзмеряемыеПоказателиСтраницы.ПодчиненныеЭлементы.СтраницаИзмеряемыеПоказателиГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПараметрыНаработки()
	
	Если ОтметкаПараметрыНаработки Тогда 
		Элементы.ПараметрыНаработкиСтраницы.ТекущаяСтраница = Элементы.ПараметрыНаработкиСтраницы.ПодчиненныеЭлементы.СтраницаПараметрыНаработкиОтменить;
	Иначе
		Элементы.ПараметрыНаработкиСтраницы.ТекущаяСтраница = Элементы.ПараметрыНаработкиСтраницы.ПодчиненныеЭлементы.СтраницаПараметрыНаработкиГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуУсловияВыявленияДефеков()
	
	Если ОтметкаУсловияВыявленияДефектов Тогда 
		Элементы.УсловияВыявленияДефековСтраницы.ТекущаяСтраница = Элементы.УсловияВыявленияДефековСтраницы.ПодчиненныеЭлементы.СтраницаУсловияВыявленияДефековОтменить;
	Иначе
		Элементы.УсловияВыявленияДефековСтраницы.ТекущаяСтраница = Элементы.УсловияВыявленияДефековСтраницы.ПодчиненныеЭлементы.СтраницаУсловияВыявленияДефековГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуВидыДефектов()
	
	Если ОтметкаВидыДефектов Тогда 
		Элементы.ВидыДефектовСтраницы.ТекущаяСтраница = Элементы.ВидыДефектовСтраницы.ПодчиненныеЭлементы.СтраницаВидыДефектовОтменить;
	Иначе
		Элементы.ВидыДефектовСтраницы.ТекущаяСтраница = Элементы.ВидыДефектовСтраницы.ПодчиненныеЭлементы.СтраницаВидыДефектовГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуПричиныДефектов()
	
	Если ОтметкаПричиныДефектов Тогда 
		Элементы.ПричиныДефектовСтраницы.ТекущаяСтраница = Элементы.ПричиныДефектовСтраницы.ПодчиненныеЭлементы.СтраницаПричиныДефектовОтменить;
	Иначе
		Элементы.ПричиныДефектовСтраницы.ТекущаяСтраница = Элементы.ПричиныДефектовСтраницы.ПодчиненныеЭлементы.СтраницаПричиныДефектовГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуКритичностьДефектов()
	
	Если ОтметкаКритичностьДефектов Тогда 
		Элементы.КритичностьДефектовСтраницы.ТекущаяСтраница = Элементы.КритичностьДефектовСтраницы.ПодчиненныеЭлементы.СтраницаКритичностьДефектовОтменить;
	Иначе
		Элементы.КритичностьДефектовСтраницы.ТекущаяСтраница = Элементы.КритичностьДефектовСтраницы.ПодчиненныеЭлементы.СтраницаКритичностьДефектовГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуТиповыеДефектыОборудования()
	
	Если ОтметкаТиповыеДефектыОборудования Тогда 
		Элементы.ТиповыеДефектыОборудованияСтраницы.ТекущаяСтраница = Элементы.ТиповыеДефектыОборудованияСтраницы.ПодчиненныеЭлементы.СтраницаТиповыеДефектыОборудованияОтменить;
	Иначе
		Элементы.ТиповыеДефектыОборудованияСтраницы.ТекущаяСтраница = Элементы.ТиповыеДефектыОборудованияСтраницы.ПодчиненныеЭлементы.СтраницаТиповыеДефектыОборудованияГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуВидыЭксплуатации()
	
	Если ОтметкаВидыЭксплуатации Тогда 
		Элементы.ВидыЭксплуатацииСтраницы.ТекущаяСтраница = Элементы.ВидыЭксплуатацииСтраницы.ПодчиненныеЭлементы.СтраницаВидыЭксплуатацииОтменить;
	Иначе
		Элементы.ВидыЭксплуатацииСтраницы.ТекущаяСтраница = Элементы.ВидыЭксплуатацииСтраницы.ПодчиненныеЭлементы.СтраницаВидыЭксплуатацииГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВПомощникЗаполненияОборудованияИНормативов(Команда)
	
	УстановитьВидимостьСтраниц(Элементы.СтраницаОсновныеНастройкиОборудованияИНормативов.Имя);
	
	Заголовок = НСтр("ru = 'Помощник заполнения настроек и справочников / 2.1. Настройки учета оборудования и нормативов'");
	
	Элементы.КоманднаяПанель.ТекущаяСтраница = Элементы.КоманднаяПанель.ПодчиненныеЭлементы.СтраницаКоманднаяПанельОстальные;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВПомощникЗаполненияПоказателейЭксплуатации(Команда)
	
	УстановитьВидимостьСтраниц(Элементы.СтраницаОсновныеНастройкиПоказателейЭксплуатации.Имя);
	
	Заголовок = НСтр("ru = 'Помощник заполнения настроек и справочников / 2.2. Настройки учета показателей эксплуатации'");
	
	Элементы.КоманднаяПанель.ТекущаяСтраница = Элементы.КоманднаяПанель.ПодчиненныеЭлементы.СтраницаКоманднаяПанельОстальные;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуГруппаОборудованиеИНормативы()
	
	Если ОтметкаГруппаОборудованиеИНормативы Тогда 
		Элементы.ГруппаОборудованиеИНормативыСтраницы.ТекущаяСтраница = Элементы.ГруппаОборудованиеИНормативыСтраницы.ПодчиненныеЭлементы.СтраницаГруппаОборудованиеИНормативыОтменить;
	Иначе
		Элементы.ГруппаОборудованиеИНормативыСтраницы.ТекущаяСтраница = Элементы.ГруппаОборудованиеИНормативыСтраницы.ПодчиненныеЭлементы.СтраницаГруппаОборудованиеИНормативыГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуГруппаПоказателиЭксплуатации()
	
	Если ОтметкаГруппаПоказателиЭксплуатации Тогда 
		Элементы.ГруппаПоказателиЭксплуатацииСтраницы.ТекущаяСтраница = Элементы.ГруппаПоказателиЭксплуатацииСтраницы.ПодчиненныеЭлементы.СтраницаГруппаПоказателиЭксплуатацииОтменить;
	Иначе
		Элементы.ГруппаПоказателиЭксплуатацииСтраницы.ТекущаяСтраница = Элементы.ГруппаПоказателиЭксплуатацииСтраницы.ПодчиненныеЭлементы.СтраницаГруппаПоказателиЭксплуатацииГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуГруппыДоступа()
	
	Если ОтметкаГруппыДоступа Тогда 
		Элементы.ГруппыДоступаСтраницы.ТекущаяСтраница = Элементы.ГруппыДоступаСтраницы.ПодчиненныеЭлементы.СтраницаГруппыДоступаОтменить;
	Иначе
		Элементы.ГруппыДоступаСтраницы.ТекущаяСтраница = Элементы.ГруппыДоступаСтраницы.ПодчиненныеЭлементы.СтраницаГруппыДоступаГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуВводНачальныхДанных()
	
	Если ОтметкаВводНачальныхДанных Тогда 
		Элементы.ВводНачальныхОстатковСтраницы.ТекущаяСтраница = Элементы.ВводНачальныхОстатковСтраницы.ПодчиненныеЭлементы.СтраницаВводНачальныхОстатковОтменить;
	Иначе
		Элементы.ВводНачальныхОстатковСтраницы.ТекущаяСтраница = Элементы.ВводНачальныхОстатковСтраницы.ПодчиненныеЭлементы.СтраницаВводНачальныхОстатковГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтраницуНастройкаПараметровПодсистемыТОиР()
	
	Если ОтметкаНастройкаПараметровПодсистемыТОиР Тогда 
		Элементы.НастройкаПараметровПодсистемыТОиРСтраницы.ТекущаяСтраница = Элементы.НастройкаПараметровПодсистемыТОиРСтраницы.ПодчиненныеЭлементы.СтраницаНастройкаПараметровПодсистемыТОиРОтменить;
	Иначе
		Элементы.НастройкаПараметровПодсистемыТОиРСтраницы.ТекущаяСтраница = Элементы.НастройкаПараметровПодсистемыТОиРСтраницы.ПодчиненныеЭлементы.СтраницаНастройкаПараметровПодсистемыТОиРГотово;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСтатусыНаСервере()
	
	Настройки = Константы.торо_СтатусыОбъектовПомощникаЗаполненияНастроекИСправочников.Получить().Получить();
	
	Если ТипЗнч(Настройки) <> Тип("Соответствие") Тогда
		Настройки = Новый Соответствие;
	КонецЕсли;
	
	Массив = МассивРеквизитовФормы();
	
	Для Каждого Элемент из Массив Цикл
		Настройки.Вставить(Элемент, ЭтаФорма[Элемент]);
	КонецЦикла;
	
	Константы.торо_СтатусыОбъектовПомощникаЗаполненияНастроекИСправочников.Установить(Новый ХранИлищеЗначения(Настройки));
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	СохраненныеНастройки = Константы.торо_СтатусыОбъектовПомощникаЗаполненияНастроекИСправочников.Получить().Получить();
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Соответствие") Тогда
		
		Массив = МассивРеквизитовФормы();
		
		Для Каждого Элемент из Массив Цикл
			ЭтаФорма[Элемент] = ?(СохраненныеНастройки[Элемент] = Неопределено, Ложь, СохраненныеНастройки[Элемент]);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОборудованиеИНормативыОтметкаНажатие(Элемент)
	ОтметкаГруппаОборудованиеИНормативы = Не ОтметкаГруппаОборудованиеИНормативы;
	
	УстановитьСтраницуГруппаОборудованиеИНормативы();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПоказателиЭксплуатацииОтметкаНажатие(Элемент)
	ОтметкаГруппаПоказателиЭксплуатации = Не ОтметкаГруппаПоказателиЭксплуатации;
	
	УстановитьСтраницуГруппаПоказателиЭксплуатации();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаГруппыДоступаНажатие(Элемент)
	
	ОтметкаГруппыДоступа = Не ОтметкаГруппыДоступа;
	
	УстановитьСтраницуГруппыДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаВводНачальныхОстатковНажатие(Элемент)
	
	ОтметкаВводНачальныхДанных = Не ОтметкаВводНачальныхДанных;
	
	УстановитьСтраницуВводНачальныхДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПараметровПодсистемыТОиРОтметкаНажатие(Элемент)
	ОтметкаНастройкаПараметровПодсистемыТОиР = Не ОтметкаНастройкаПараметровПодсистемыТОиР;
	
	УстановитьСтраницуНастройкаПараметровПодсистемыТОиР();
КонецПроцедуры

ВыполняетсяЗакрытие = Ложь;

#КонецОбласти
