#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Техкарта") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
															"Техкарта", 
															"Технологическая карта ремонта", 
															СформироватьПечатнуюФорму (МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТЕХКАРТА";
	УстановитьПривилегированныйРежим(Истина);
	ТабличныйДокумент = ПечатьТехкарты(МассивОбъектов, ПараметрыПечати);
	УстановитьПривилегированныйРежим(Ложь);
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьТехкарты(МассивОбъектов, ПараметрыПечати)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Техкарта");
	
	ОбластьЗаголовка = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_Ремонты.Наименование,
	|	торо_Ремонты.НормаВремени КАК Продолжительность
	|ИЗ
	|	Справочник.торо_ТехКарты КАК торо_Ремонты
	|ГДЕ
	|	торо_Ремонты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",МассивОбъектов[0]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОбластьЗаголовка.Параметры.Заполнить(Выборка);
	ОбластьЗаголовка.Параметры.Продолжительность = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Выборка.Продолжительность);
	
	ТабДок.Вывести(ОбластьЗаголовка);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения,
	|	торо_РемонтыМатериальныеЗатраты.Количество,
	|	торо_РемонтыМатериальныеЗатраты.Номенклатура,
	|	торо_РемонтыМатериальныеЗатраты.Операция,
	|	торо_РемонтыМатериальныеЗатраты.Качество
	|ПОМЕСТИТЬ ТабМатериальныеЗатраты
	|ИЗ
	|	&ТабМатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения,
	|	торо_РемонтыМатериальныеЗатраты.Количество,
	|	торо_РемонтыМатериальныеЗатраты.Номенклатура,
	|	торо_РемонтыМатериальныеЗатраты.Операция,
	|	торо_РемонтыМатериальныеЗатраты.Качество
	|ПОМЕСТИТЬ МатериальныеЗатраты
	|ИЗ
	|	ТабМатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения,
	|	торо_РемонтыМатериальныеЗатраты.Количество,
	|	торо_РемонтыМатериальныеЗатраты.Номенклатура,
	|	торо_РемонтыМатериальныеЗатраты.Операция,
	|	торо_РемонтыМатериальныеЗатраты.Качество
	|ИЗ
	|	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	|ГДЕ
	|	торо_РемонтыМатериальныеЗатраты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТрудовыеЗатраты.ВремяРаботы,
	|	торо_ТрудовыеЗатраты.Квалификация,
	|	торо_ТрудовыеЗатраты.Количество,
	|	торо_ТрудовыеЗатраты.Операция
	|ПОМЕСТИТЬ ТабТрудовыеЗатраты
	|ИЗ
	|	&ТабТрудовыеЗатраты КАК торо_ТрудовыеЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТрудовыеЗатраты.ВремяРаботы,
	|	торо_ТрудовыеЗатраты.Квалификация,
	|	торо_ТрудовыеЗатраты.Количество,
	|	торо_ТрудовыеЗатраты.Операция
	|ПОМЕСТИТЬ ТрудовыеЗатраты
	|ИЗ
	|	ТабТрудовыеЗатраты КАК торо_ТрудовыеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ТрудовыеЗатраты.ВремяРаботы,
	|	торо_ТрудовыеЗатраты.Квалификация,
	|	торо_ТрудовыеЗатраты.Количество,
	|	торо_ТрудовыеЗатраты.Операция
	|ИЗ
	|	Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_ТрудовыеЗатраты
	|ГДЕ
	|	торо_ТрудовыеЗатраты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ИнструментыИТехника.ЕдиницаИзмерения,
	|	торо_ИнструментыИТехника.Инструмент,
	|	торо_ИнструментыИТехника.Количество,
	|	торо_ИнструментыИТехника.Операция
	|ПОМЕСТИТЬ ТабИнструментыИТехника
	|ИЗ
	|	&ТабИнструментыИТехника КАК торо_ИнструментыИТехника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ИнструментыИТехника.ЕдиницаИзмерения,
	|	торо_ИнструментыИТехника.Инструмент,
	|	торо_ИнструментыИТехника.Количество,
	|	торо_ИнструментыИТехника.Операция
	|ПОМЕСТИТЬ ИнструментыИТехника
	|ИЗ
	|	ТабИнструментыИТехника КАК торо_ИнструментыИТехника
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ИнструментыИТехника.ЕдиницаИзмерения,
	|	торо_ИнструментыИТехника.Инструмент,
	|	торо_ИнструментыИТехника.Количество,
	|	торо_ИнструментыИТехника.Операция
	|ИЗ
	|	Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_ИнструментыИТехника
	|ГДЕ
	|	торо_ИнструментыИТехника.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ИзмеряемыеПоказатели.Показатель,
	|	торо_ИзмеряемыеПоказатели.Операция
	|ПОМЕСТИТЬ ТабИзмеряемыеПоказатели
	|ИЗ
	|	&ТабИзмеряемыеПоказатели КАК торо_ИзмеряемыеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ИзмеряемыеПоказатели.Показатель,
	|	торо_ИзмеряемыеПоказатели.Операция
	|ПОМЕСТИТЬ ИзмеряемыеПоказатели
	|ИЗ
	|	ТабИзмеряемыеПоказатели КАК торо_ИзмеряемыеПоказатели
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ИзмеряемыеПоказатели.Показатель,
	|	торо_ИзмеряемыеПоказатели.Операция
	|ИЗ
	|	Справочник.торо_ТехКарты.ИзмеряемыеПоказатели КАК торо_ИзмеряемыеПоказатели
	|ГДЕ
	|	торо_ИзмеряемыеПоказатели.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыСписокОпераций.Операция,
	|	торо_РемонтыСписокОпераций.НормаВремениВСекундах,
	|	торо_РемонтыСписокОпераций.СпособВыполнения
	|ПОМЕСТИТЬ ТабОпераций
	|ИЗ
	|	Справочник.торо_ТехКарты.СписокОпераций КАК торо_РемонтыСписокОпераций
	|ГДЕ
	|	торо_РемонтыСписокОпераций.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыСписокОпераций.Операция КАК Операция,
	|	торо_РемонтыСписокОпераций.НормаВремениВСекундах КАК Продолжительность,
	|	торо_РемонтыСписокОпераций.СпособВыполнения КАК Способ,
	|	МатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдИзм,
	|	МатериальныеЗатраты.Количество,
	|	МатериальныеЗатраты.Номенклатура,
	|	""МатериальныеЗатраты"" КАК ДопКолонка,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * МатериальныеЗатраты.Количество * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Сумма,
	|	NULL КАК Квалификация,
	|	NULL КАК Время,
	|	NULL КАК Инструмент,
	|	NULL КАК Показатель
	|ИЗ
	|	ТабОпераций КАК торо_РемонтыСписокОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатериальныеЗатраты КАК МатериальныеЗатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|				ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|			ПО МатериальныеЗатраты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ПО торо_РемонтыСписокОпераций.Операция = МатериальныеЗатраты.Операция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыСписокОпераций.Операция,
	|	торо_РемонтыСписокОпераций.НормаВремениВСекундах,
	|	торо_РемонтыСписокОпераций.СпособВыполнения,
	|	NULL,
	|	ТрудовыеЗатраты.Количество,
	|	NULL,
	|	""ТрудовыеЗатраты"",
	|	ЕСТЬNULL(торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость, 0) * ЕСТЬNULL(ТрудовыеЗатраты.Количество, 0) * ЕСТЬNULL(ТрудовыеЗатраты.ВремяРаботы, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) / 3600,
	|	ТрудовыеЗатраты.Квалификация,
	|	ТрудовыеЗатраты.ВремяРаботы,
	|	NULL,
	|	NULL
	|ИЗ
	|	ТабОпераций КАК торо_РемонтыСписокОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудовыеЗатраты КАК ТрудовыеЗатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|				ПО торо_СтоимостьЧасаКвалификацииСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|			ПО ТрудовыеЗатраты.Квалификация = торо_СтоимостьЧасаКвалификацииСрезПоследних.Квалификация
	|		ПО торо_РемонтыСписокОпераций.Операция = ТрудовыеЗатраты.Операция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыСписокОпераций.Операция,
	|	торо_РемонтыСписокОпераций.НормаВремениВСекундах,
	|	торо_РемонтыСписокОпераций.СпособВыполнения,
	|	ИнструментыИТехника.ЕдиницаИзмерения,
	|	ИнструментыИТехника.Количество,
	|	NULL,
	|	""Инструменты"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	ИнструментыИТехника.Инструмент,
	|	NULL
	|ИЗ
	|	ТабОпераций КАК торо_РемонтыСписокОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнструментыИТехника КАК ИнструментыИТехника
	|		ПО торо_РемонтыСписокОпераций.Операция = ИнструментыИТехника.Операция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыСписокОпераций.Операция,
	|	торо_РемонтыСписокОпераций.НормаВремениВСекундах,
	|	торо_РемонтыСписокОпераций.СпособВыполнения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	""Показатели"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ИзмеряемыеПоказатели.Показатель
	|ИЗ
	|	ТабОпераций КАК торо_РемонтыСписокОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИзмеряемыеПоказатели КАК ИзмеряемыеПоказатели
	|		ПО (ИзмеряемыеПоказатели.Операция = торо_РемонтыСписокОпераций.Операция)
	|ИТОГИ
	|	МИНИМУМ(НормаВремениВСекундах),
	|	МИНИМУМ(СпособВыполнения)
	|ПО
	|	Операция
	|";
	Запрос.УстановитьПараметр("Ссылка",МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ТабМатериальныеЗатраты",МассивОбъектов[0].МатериальныеЗатраты);
	Запрос.УстановитьПараметр("ТабТрудовыеЗатраты",МассивОбъектов[0].ТрудовыеЗатраты);
	Запрос.УстановитьПараметр("ТабИнструментыИТехника",МассивОбъектов[0].ИнструментыИТехника);
	Запрос.УстановитьПараметр("ТабИзмеряемыеПоказатели",МассивОбъектов[0].ИзмеряемыеПоказатели);
	
	ВыборкаОпераций = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьРазделитель 	= Макет.ПолучитьОбласть("ОбластьРазделитель");
	ОбластьОперация 	= Макет.ПолучитьОбласть("ОбластьОперация");
	
	ОбластьШапкаМатериальные = Макет.ПолучитьОбласть("ОбластьШапкаМатериальные");
	ОбластьДанныеМатериальные = Макет.ПолучитьОбласть("ОбластьДанныеМатериальные");
	
	ОбластьШапкаТрудовые = Макет.ПолучитьОбласть("ОбластьШапкаТрудовые");
	ОбластьДанныеТрудовые = Макет.ПолучитьОбласть("ОбластьДанныеТрудовые");
	
	ОбластьШапкаИнструменты = Макет.ПолучитьОбласть("ОбластьШапкаИнструменты");
	ОбластьДанныеИнструменты = Макет.ПолучитьОбласть("ОбластьДанныеИнструменты");
	
	ОбластьШапкаПоказатели = Макет.ПолучитьОбласть("ОбластьШапкаПоказатели");
	ОбластьДанныеПоказатели = Макет.ПолучитьОбласть("ОбластьДанныеПоказатели");
	
	инд0 = 5;
	инд = инд0;
	
	Пока ВыборкаОпераций.Следующий() Цикл
		ТабДок.Вывести(ОбластьРазделитель);
		ОбластьОперация.Параметры.Заполнить(ВыборкаОпераций);
		ОбластьОперация.Параметры.Продолжительность = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(ВыборкаОпераций.Продолжительность);
		ТабДок.Вывести(ОбластьОперация);
		
		инд0 = инд +6;
		инд = инд0;
		
		Выборка = ВыборкаОпераций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтрПоиска = Новый Структура("ДопКолонка","МатериальныеЗатраты");
		
		ТабДок.Вывести(ОбластьШапкаМатериальные);
		
		Пока Выборка.НайтиСледующий(СтрПоиска) Цикл
			
			ОбластьДанныеМатериальные.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьДанныеМатериальные);
			
			инд = инд + 1;
		КонецЦикла;
		
		Область = ТабДок.Область(инд0,3,инд,5);
		Область.Объединить();
		
		Выборка.Сбросить();
		
		СтрПоиска = Новый Структура("ДопКолонка","ТрудовыеЗатраты");
		
		инд0 = инд + 1;
		инд = инд + 1;
		
		ТабДок.Вывести(ОбластьШапкаТрудовые);
		
		Пока Выборка.НайтиСледующий(СтрПоиска) Цикл
			
			ОбластьДанныеТрудовые.Параметры.Заполнить(Выборка);
			ОбластьДанныеТрудовые.Параметры.Время = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Выборка.Время);
			ТабДок.Вывести(ОбластьДанныеТрудовые);
			
			инд = инд + 1;
		КонецЦикла;
		
		Область = ТабДок.Область(инд0,3,инд,5);
		Область.Объединить();
		
		Выборка.Сбросить();
		
		СтрПоиска = Новый Структура("ДопКолонка","Инструменты");
		
		инд0 = инд + 1;
		инд = инд + 1;
		
		ТабДок.Вывести(ОбластьШапкаИнструменты);
		
		Пока Выборка.НайтиСледующий(СтрПоиска) Цикл
			
			ОбластьДанныеИнструменты.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьДанныеИнструменты);
			
			инд = инд + 1;
		КонецЦикла;
		
		Область = ТабДок.Область(инд0,3,инд,5);
		Область.Объединить();
		
		Выборка.Сбросить();
		
		СтрПоиска = Новый Структура("ДопКолонка","Показатели");
		
		инд0 = инд + 1;
		инд = инд + 1;
		
		ТабДок.Вывести(ОбластьШапкаПоказатели);
		
		Пока Выборка.НайтиСледующий(СтрПоиска) Цикл
			
			ОбластьДанныеПоказатели.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьДанныеПоказатели);
			
			инд = инд + 1;
		КонецЦикла;
		
		Область = ТабДок.Область(инд0,3,инд,5);
		Область.Объединить();
		Область.ГраницаСнизу = новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	КонецЦикла;
	ТабДок.КлючПараметровПечати = "торо_Ремонты_Техкарта";
	ТабДок.ИмяПараметровПечати = "торо_Ремонты_Техкарта";

	Возврат ТабДок;
КонецФункции

#КонецОбласти

#КонецЕсли