
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоПравамПользвателя();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоПравамПользвателя()
	
	СоответствиеЭлементов = Новый Соответствие;
	СоответствиеЭлементов.Вставить("ГруппаВидыНоменклатуры", Метаданные.Справочники.ВидыНоменклатуры);
	СоответствиеЭлементов.Вставить("ГруппаЕдиницыИзмерения", Метаданные.Справочники.ЕдиницыИзмерения);
	СоответствиеЭлементов.Вставить("ГруппаПроизводители", Метаданные.Справочники.Производители);
	СоответствиеЭлементов.Вставить("ГруппаСерииНоменклатуры", Метаданные.Справочники.СерииНоменклатуры);
	СоответствиеЭлементов.Вставить("ГруппаУпаковкиНоменклатуры", Метаданные.Справочники.УпаковкиНоменклатуры);
	
	Для каждого КлючИЗначение из СоответствиеЭлементов Цикл
		Если НЕ ПравоДоступа("Просмотр", КлючИЗначение.Значение)	И Элементы.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			Элементы[КлючИЗначение.Ключ].Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбщиеСправочники

&НаКлиенте
Процедура ОткрытьВидыНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЕдиницыИзмерения(Команда)
	
	ОткрытьФорму("Справочник.ЕдиницыИзмерения.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСерииНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУпаковкиНоменклатуры(Команда)
	
	ОткрытьФорму("Справочник.УпаковкиНоменклатуры.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроизводители(Команда)
	
	ОткрытьФорму("Справочник.Производители.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
