////////////////////////////////////////////////////////////////////////////////
// торо_РаботаСНормативамиСервер: методы, для работы с нормативами
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
// Процедура записывает все нормативы ОР при программном изменении типового ОР.
// При интерактивном изменении, процедуры записи вызываются из формы ОР поотдельности.
// Процедура должна вызываться ДО изменения реквизита ТиповойОР.
//
// Параметры:
//		ТиповойОРСсылка - СправочникСсылка.торо_ТиповыеОР - ссылка на типовой ОР.
//		ОРСсылка - СправочникСсылка.торо_ОбъектыРемонта - ссылка на объект ремонта.
//		ЗаписыватьНормативныеРемонты - Булево - Записывать нормативные ремонты.
//		ЗаписыватьНормативныеЦепочки - Булево - Записывать нормативные цепочки.
//		ЗаписыватьПредшествующиеРемонты - Булево - Записывать предшествующие ремонты.
//		ЗаписыватьЗамещаемыеРемонты - Булево - Записывать замещаемые ремонты.
//		ЗаписыватьКонтролируемыеПоказатели - Булево - Записывать контролируемые показатели.
//		ЗаписыватьНормыЗапчастей - Булево - Записывать нормы запчастей.
//		
Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР(ТиповойОРСсылка, ОРСсылка,
	ЗаписыватьНормативныеРемонты 		= Истина,
	ЗаписыватьНормативныеЦепочки 		= Истина,
	ЗаписыватьПредшествующиеРемонты 	= Истина,
	ЗаписыватьЗамещаемыеРемонты 		= Истина,
	ЗаписыватьКонтролируемыеПоказатели  = Истина,
	ЗаписыватьНормыЗапчастей 			= Истина) Экспорт
	
	Если ЗаписыватьНормативныеРемонты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	&ОРссылка КАК ОбъектРемонта,
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.Ссылка КАК ТиповойОР,
		               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
		               |	торо_НормативныеРемонтыОборудования.СпособПланирования,
		               |	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.СпособВыполнения,
		               |	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		               |	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
		               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
		               |	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность,
		               |	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		               |	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования,
		               |	0 КАК Приоритет
		               |ПОМЕСТИТЬ ТабБазПриоритетов
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
		               |	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.ТиповойОР,
		               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
		               |	торо_НормативныеРемонтыОборудования.СпособПланирования,
		               |	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.СпособВыполнения,
		               |	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		               |	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
		               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
		               |	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность,
		               |	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		               |	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования,
		               |	1
		               |ИЗ
		               |	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОРСсылка
		               |	И торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ТиповойОР,
		               |	ТабБазПриоритетов.НормативныйРемонт,
		               |	ТабБазПриоритетов.СпособПланирования,
		               |	ТабБазПриоритетов.ГрафикРемонтныхРабот,
		               |	ТабБазПриоритетов.СпособВыполнения,
		               |	ТабБазПриоритетов.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		               |	ТабБазПриоритетов.СпособУчетаДатыОтсчета,
		               |	ТабБазПриоритетов.НеУчаствуетВПланировании,
		               |	ТабБазПриоритетов.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		               |	ТабБазПриоритетов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		               |	ТабБазПриоритетов.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		               |	ТабБазПриоритетов.НеУчитыватьПродолжительность,
		               |	ТабБазПриоритетов.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		               |	ТабБазПриоритетов.УчитыватьПростоиОборудования,
		               |	ВЫБОР
		               |		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Приоритет
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		               |			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		               |			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
					   
		Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
		
		ТаблицаНормативов = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаНормативов);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудованияУдаленные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ЗаписыватьНормативныеЦепочки Тогда
		
		// Записываются при записи Типового ОР. Записывать дополнительно нет необходимости.
				
	КонецЕсли;
	
	Если ЗаписыватьПредшествующиеРемонты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.Ссылка
		               |ПОМЕСТИТЬ ДействующиеВР
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
		               |	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта,
		               |	&ОРСсылка КАК ОбъектРемонта,
		               |	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта,
		               |	торо_ТиповыеОРПредшествующиеРемонты.Ссылка КАК ТиповойОР,
		               |	0 КАК Приоритет
		               |ПОМЕСТИТЬ ТабБазПриоритетов
		               |ИЗ
		               |	ДействующиеВР КАК торо_ТиповыеОРНормативныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
		               |		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРПредшествующиеРемонты.Ссылка
		               |			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта
		               |			И (торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта В
		               |				(ВЫБРАТЬ
		               |					ДействующиеВР.ВидРемонта
		               |				ИЗ
		               |					ДействующиеВР КАК ДействующиеВР))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта,
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ПредшествующийВидРемонта,
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР,
		               |	1
		               |ИЗ
		               |	РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования КАК торо_ПредшествующиеНормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта = &ОРСсылка
		               |	И торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ПредшествующийВидРемонта,
		               |	ТабБазПриоритетов.ТиповойОР,
		               |	ВЫБОР
		               |		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Приоритет
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		               |			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		               |			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
		
		Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
		
		ТаблицаПредшествующих = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаПредшествующих);
		НаборЗаписей.Записать();
		
	КонецЕсли;
		
	Если ЗаписыватьЗамещаемыеРемонты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.Ссылка
		               |ПОМЕСТИТЬ ДействующиеВР
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
		               |	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта,
		               |	&ОРСсылка КАК ОбъектРемонта,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка КАК ТиповойОР,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница,
		               |	0 КАК Приоритет
		               |ПОМЕСТИТЬ ТабБазПриоритетов
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
		               |		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРЗамещаемыеРемонты.Ссылка
		               |			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта
		               |			И (торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта В
		               |				(ВЫБРАТЬ
		               |					ДействующиеВР.ВидРемонта
		               |				ИЗ
		               |					ДействующиеВР КАК ДействующиеВР))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница,
		               |	1
		               |ИЗ
		               |	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
		               |ГДЕ
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта = &ОРСсылка
		               |	И торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ЗамещаемыйВидРемонта,
		               |	ТабБазПриоритетов.ТиповойОР,
		               |	ТабБазПриоритетов.СпособЗамещения,
		               |	ТабБазПриоритетов.НачальнаяГраница,
		               |	ТабБазПриоритетов.КонечнаяГраница,
		               |	ВЫБОР
		               |		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Приоритет
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		               |			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		               |			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
		
		Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
		
		ТаблицаЗамещаемых = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаЗамещаемых);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ЗаписыватьНормыЗапчастей Тогда
		
		
	КонецЕсли;
	
	Если ЗаписыватьКонтролируемыеПоказатели Тогда
		
		// Удалим неиспользуемые показатели, оставшиеся от прошлого типового.
		Если НЕ ЗначениеЗаполнено(ТиповойОРСсылка) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель
			               |ИЗ
			               |	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
			               |ГДЕ
			               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = &ОРСсылка
			               |	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален";
			Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					МенеджерЗаписи = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ОбъектРемонта = ОРСсылка;
					МенеджерЗаписи.Показатель = Выборка.Показатель;
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.Удалить();
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
