#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьЖурналДефектов(Команда)
	
	Отказ = Ложь;

	Если ЗначениеЗаполнено(НачПериода) Тогда
		Если НЕ ЗначениеЗаполнено(КонПериода) Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить дату окончания периода.'"));
			Отказ = Истина;
		ИначеЕсли КонПериода < НачПериода Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания периода меньше даты его начала.'"));
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(КонПериода) Тогда
		Если НЕ ЗначениеЗаполнено(НачПериода) Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить дату начала периода.'"));
			Отказ = Истина;
		ИначеЕсли КонПериода < НачПериода Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания периода меньше даты его начала.'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;		
 	Результат=ПолучитьСписокДефектов();	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЖурналаДефектов(Команда)
	
	СформироватьЖурналДефектов(Неопределено);
	Результат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьСписокДефектов()		
	
		ТабДок=Результат;
		ТабДок.Очистить();
		
		Макет = Документы.торо_ВыявленныеДефекты.ПолучитьМакет("ЖурналДефектов");
		// Заголовок
		Область = Макет.ПолучитьОбласть("Заголовок");
		ТабДок.Вывести(Область);
		
		// Отбор
		ВывестиОбласть = Ложь;
		Область = Макет.ПолучитьОбласть("Отбор");
		Если ЗначениеЗаполнено(Организация) Тогда
			ВывестиОбласть					= Истина;
			Область.Параметры.Организация	= Организация;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			ВывестиОбласть								= Истина;
			Область.Параметры.ПодразделениеОрганизации	= ПодразделениеОрганизации;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОР) Тогда
			ВывестиОбласть			= Истина;
			Область.Параметры.ОР	= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
			ВывестиОбласть			= Истина;
			Область.Параметры.Дата	= "Период с: " + НачПериода + " по: " + КонПериода;
		КонецЕсли;
		
		Если ВывестиОбласть Тогда
			ТабДок.Вывести(Область);
		КонецЕсли;
		
		СписокДефектов = Новый Запрос();		
		
		СписокДефектов.Текст ="ВЫБРАТЬ
		                      |	торо_ВыявленныеДефектыСписокДефектов.ID,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта,
		                      |	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение
		                      |ПОМЕСТИТЬ ВТДефекты
		                      |ИЗ
		                      |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		                      |ГДЕ
		                      |	ВЫБОР
		                      |			КОГДА &Организация = НЕОПРЕДЕЛЕНО
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация = &Организация
		                      |		КОНЕЦ
		                      |	И ВЫБОР
		                      |			КОГДА &ОбъектРемонта = НЕОПРЕДЕЛЕНО
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ ВЫБОР
		                      |					КОГДА &ОбъектРемонтаРодитель = НЕОПРЕДЕЛЕНО
		                      |						ТОГДА торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта
		                      |					ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта В ИЕРАРХИИ (&ОбъектРемонтаРодитель)
		                      |				КОНЕЦ
		                      |		КОНЕЦ
		                      |	И ВЫБОР
		                      |			КОГДА &Подразделение = НЕОПРЕДЕЛЕНО
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение
		                      |		КОНЕЦ
		                      |	И ВЫБОР
		                      |			КОГДА &НачПериода = ""НЕОПРЕДЕЛЕНО""
		                      |					ИЛИ &КонПериода = ""НЕОПРЕДЕЛЕНО""
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения МЕЖДУ &НачПериода И &КонПериода
		                      |		КОНЕЦ
		                      |	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	торо_Ремонты.Регистратор,
		                      |	торо_Ремонты.ID
		                      |ПОМЕСТИТЬ ВТРСРемонты
		                      |ИЗ
		                      |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		                      |ГДЕ
		                      |	торо_Ремонты.ID В
		                      |			(ВЫБРАТЬ
		                      |				ВТДефекты.ID
		                      |			ИЗ
		                      |				ВТДефекты)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТРСРемонты.Регистратор,
		                      |	ВТДефекты.ОбъектРемонта КАК ОбъектРемонта,
		                      |	ВТДефекты.ОтказавшийЭлемент,
		                      |	ВТДефекты.ДефектОписание,
		                      |	ВТДефекты.ДефектПричина,
		                      |	ВТДефекты.ВидДефекта,
		                      |	ВТДефекты.ПоследствияДефекта,
		                      |	ВТДефекты.НаправлениеНаУстранение,
		                      |	ВТДефекты.ID,
		                      |	ВТДефекты.Подразделение,
		                      |	ВТДефекты.Ответственный,
		                      |	ВТДефекты.ДатаОбнаружения,
		                      |	ВТДефекты.Организация
		                      |ПОМЕСТИТЬ ВТДефектыОборудования
		                      |ИЗ
		                      |	ВТДефекты КАК ВТДефекты
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
		                      |		ПО ВТДефекты.ID = ВТРСРемонты.ID
		                      |ГДЕ
		                      |	ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ВТДефектыОборудования.Регистратор,
		                      |	ВТДефектыОборудования.ОбъектРемонта,
		                      |	ВТДефектыОборудования.ОтказавшийЭлемент,
		                      |	ВТДефектыОборудования.ДефектОписание,
		                      |	ВТДефектыОборудования.ДефектПричина,
		                      |	ВТДефектыОборудования.ВидДефекта,
		                      |	ВТДефектыОборудования.ПоследствияДефекта,
		                      |	ВТДефектыОборудования.НаправлениеНаУстранение,
		                      |	ВТДефектыОборудования.ID,
		                      |	ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА isnull(ВТРСРемонты.Регистратор,ВТДефектыОборудования.Регистратор)
		                      |		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор
		                      |	КОНЕЦ КАК Регистратор1,
		                      |	ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА ""Не устранен""
		                      |		ИНАЧЕ ""Устранен""
		                      |	КОНЕЦ КАК Устранен,
		                      |	ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА ВЫБОР
		                      |					КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
		                      |						ТОГДА ""Зарегистрирован""
		                      |					ИНАЧЕ ВЫБОР
		                      |							КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		                      |								ТОГДА ""Работы не начаты""
		                      |							ИНАЧЕ ""Работы начаты""
		                      |						КОНЕЦ
		                      |				КОНЕЦ
		                      |		ИНАЧЕ ""Работы завершены""
		                      |	КОНЕЦ КАК СостояниеРабот,
		                      |ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА ВЫБОР
		                      |				КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
		                      |					ТОГДА 0
		                      |				ИНАЧЕ ВЫБОР
		                      |					КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		                      |						ТОГДА 2
		                      |					ИНАЧЕ 3
		                      |				КОНЕЦ
		                      |			КОНЕЦ
		                      |		ИНАЧЕ 1
		                      |КОНЕЦ КАК СтатусСортировки,
		                      |	ВТДефектыОборудования.ДатаОбнаружения,
		                      |	ВТДефектыОборудования.Ответственный
		                      |ИЗ
		                      |	ВТДефектыОборудования КАК ВТДефектыОборудования
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		                      |		ПО ВТДефектыОборудования.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
		                      |		ПО ВТДефектыОборудования.ID = ВТРСРемонты.ID
		                      |			И (ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
		                      |				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		                      |				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ВТДефектыОборудования.ДатаОбнаружения,
		                      |	СтатусСортировки УБЫВ
		                      |ИТОГИ ПО
		                      |	ВТДефектыОборудования.ID";
		
		
		// СписокДефектов
		Область = Макет.ПолучитьОбласть("СписокДефектовШапка");
		ТабДок.Вывести(Область);
		ОбластьСписокДефектов = Макет.ПолучитьОбласть("СписокДефектов");
		
		// Если поле "Организация" заполнено, то в запросе отбор по ней
		Если ЗначениеЗаполнено(Организация) Тогда
			СписокДефектов.УстановитьПараметр("Организация", Организация);
		Иначе
			СписокДефектов.УстановитьПараметр("Организация", Неопределено);
		КонецЕсли;
		
		// Если поле "Подразделение" заполнено, то в запросе отбор по нему
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			СписокДефектов.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
		Иначе
			СписокДефектов.УстановитьПараметр("Подразделение", Неопределено);
		КонецЕсли;	
		
		// Если поле "ОР" заполнено, то в запросе отбор по нему
		СписокОРДляОтбора = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ОР) Тогда
			СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
			СписокДефектов.УстановитьПараметр("ОбъектРемонта", ОР);	
		Иначе
			СписокДефектов.УстановитьПараметр("ОбъектРемонта", Неопределено);
			СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
		КонецЕсли;	
		
		// Если поля "Даты" заполнено, то в запросе отбор по ним
		Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
			СписокДефектов.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
			СписокДефектов.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
		Иначе
			СписокДефектов.УстановитьПараметр("НачПериода", "НЕОПРЕДЕЛЕНО");
			СписокДефектов.УстановитьПараметр("КонПериода", "НЕОПРЕДЕЛЕНО");
		КонецЕсли;		
		
		ДефектыВыборка		 = СписокДефектов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДефектыВыборка.Следующий() Цикл 
			
			Выборка = ДефектыВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если Выборка.Следующий() Тогда
				ОбластьСписокДефектов.Параметры.Заполнить(Выборка);
				ОбластьСписокДефектов.Параметры.ОбъектРемонтаПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОбъектРемонта);
				ОбластьСписокДефектов.Параметры.ОтказавшийЭлементПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОтказавшийЭлемент);
				ТабДок.Вывести(ОбластьСписокДефектов);
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;
		// Зададим параметры макета
		ТабДок.ПолеСверху         = 0;
		ТабДок.ПолеСлева          = 0;
		ТабДок.ПолеСнизу          = 0;
		ТабДок.ПолеСправа         = 0;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб  = ИСТИНА;
		
		Возврат ТабДок;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		КонПериода = Параметры.ПараметрыОтбора.КонПериода;
		НачПериода = Параметры.ПараметрыОтбора.НачПериода;
		ОР = Параметры.ПараметрыОтбора.ОР;
		Организация = Параметры.ПараметрыОтбора.Организация;
		ПодразделениеОрганизации = Параметры.ПараметрыОтбора.ПодразделениеДляДок;
	Иначе 
		КонПериода = КонецМесяца(ТекущаяДата());
		НачПериода = НачалоМесяца(ТекущаяДата());
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновнаяОрганизация",Истина);
		ПодразделениеОрганизации = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновноеПодразделение",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти