////////////////////////////////////////////////////////////////////////////////
// торо_ОбщегоНазначенияКлиент: общие клиентские методы.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Функция предназначена для обхода зацикливания при вызове серверных функций
// из события ПриАктивизацииСтроки.
&НаКлиенте
Функция СравнитьПараметрыТекущейСтроки(Ключ, Значение, Хранилище) Экспорт
	Если Хранилище = Неопределено Тогда
		Хранилище = Новый Соответствие;
	КонецЕсли;
	
	СохрЗначение = Хранилище.Получить(Ключ);
	Если СохрЗначение = Значение Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// Функция предназначена для обхода зацикливания при вызове серверных функций
// из события ПриАктивизацииСтроки.
&НаКлиенте
Процедура ЗапомнитьПараметрыТекущейСтроки(Ключ, Значение, Хранилище) Экспорт
	Если Хранилище = Неопределено Тогда
		Хранилище = Новый Соответствие;
	КонецЕсли;
	
	СохрЗначение = Хранилище.Получить(Ключ);
	Если СохрЗначение <> Значение Тогда
		Хранилище.Удалить(Ключ);
		
		Хранилище.Вставить(Ключ, Значение);
	КонецЕсли;

КонецПроцедуры

// Рекурсивно заполняет массив значениями из указанной колонки дерева.
&НаКлиенте
Процедура ДанныеФормыДеревоВМассив(МассивДанных,Дерево,ИмяКолонки) Экспорт
	
	Для Каждого ПодчиненнаяСтрока Из Дерево.ПолучитьЭлементы() Цикл
		МассивДанных.Добавить(ПодчиненнаяСтрока[ИмяКолонки]);
		ДанныеФормыДеревоВМассив(МассивДанных,ПодчиненнаяСтрока,ИмяКолонки)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
