#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Печать
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяОрганизация",
			Истина);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
			
			Объект.Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновноеПодразделение",
			Истина);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			
			Объект.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнойОтветственный",
			Справочники.Пользователи.ПустаяСсылка());
			
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОперации") Тогда
		Объект.ВидОперации = Параметры.ВидОперации;
	КонецЕсли;
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента("", РеквизитФормыВЗначение("Объект"), ЭтаФорма);
	// Заголовок формы--	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьВнешнийВидФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	Для Каждого Строка Из Объект.КвалификацииСотрудников Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Квалификация) Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для сотрудника %1 не заполнена квалификация!'"), Строка.Сотрудник));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ не записан!'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента("", РеквизитФормыВЗначение("Объект"), ЭтаФорма);
	// Заголовок формы--
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.КвалификацииСотрудников.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.КвалификацииСотрудников.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент",Элемент)),
						НСтр("ru = 'Табличная часть документа будет очищена! Продолжить?'"), РежимДиалогаВопрос.ДаНет, 60);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКвалификацииСотрудников
&НаКлиенте
Процедура КвалификацииСотрудниковКвалификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
		
		ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДанные.Сотрудник) Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для выбора удаляемой квалификации необходимо указать сотрудника!'"));
			Элементы.КвалификацииСотрудников.ТекущийЭлемент = Элементы.КвалификацииСотрудниковСотрудник;
			Возврат;
		КонецЕсли;
		
		МассивКвалификаций = Новый Массив;
		МассивСтрок = Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("Сотрудник", ТекДанные.Сотрудник));
		Для каждого Элем Из МассивСтрок Цикл
			
			МассивКвалификаций.Добавить(Элем.Квалификация);
			
		КонецЦикла;
		
		СписокВыбора = торо_ПроцедурыУправленияПерсоналом.ЗаполнитьСписокВыбораКвалификаций(Объект.Ссылка, ТекДанные.Сотрудник, Объект.Дата, ТекДанные.Квалификация, МассивКвалификаций);
		
		Элемент.СписокВыбора.Очистить();
		Для каждого Элем Из СписокВыбора Цикл
			Элемент.СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Для добавления сотрудников необходимо выбрать организацию!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Копирование Тогда
		Отказ = Истина;
		ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НС = Объект.КвалификацииСотрудников.Добавить();
		НС.Сотрудник = ТекДанные.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
		Возврат
	КонецЕсли;
	
	ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("Сотрудник, Квалификация", ТекДанные.Сотрудник, ТекДанные.Квалификация)).Количество() > 1 Тогда
		Отказ = Истина;
		Если ОтменаРедактирования Тогда
			Объект.КвалификацииСотрудников.Удалить(ТекДанные);
		Иначе
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В данном документе сотруднику %1 уже присваевается подобная квалификация!'"), ТекДанные.Сотрудник));
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковОсновнаяПриИзменении(Элемент)
	
	ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Если ТекДанные.Основная Тогда
		
		МассивСтрок = Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("Сотрудник, Основная", ТекДанные.Сотрудник, Истина));
		ПустаяКвалификация = ПредопределенноеЗначение("Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			Для каждого Строка Из МассивСтрок Цикл
				Строка.Основная = Ложь;
				Строка.НоваяОсновная = ПустаяКвалификация;
			КонецЦикла; 
		КонецЕсли; 
		ТекДанные.Основная      = Истина;
		ТекОсновнаяКвалификация = торо_ПроцедурыУправленияПерсоналом.ПолучитьОсновнуюКвалификацию(ТекДанные.Сотрудник, Объект.Ссылка);
		ТекДанные.НоваяОсновная = ТекОсновнаяКвалификация;
	Иначе
		ТекДанные.НоваяОсновная = ПредопределенноеЗначение("Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка");
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.Сотрудники.ФормаВыбора", Новый Структура("РежимВыбора", Истина), Элемент, Объект.Ссылка);
	
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГоловнаяОрганизация");
	ЭлементОтбора.ПравоеЗначение = Объект.Организация;
	ЭлементОтбора.Использование = Истина;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииСотрудниковКвалификацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекДанные = Элементы.КвалификацииСотрудников.ТекущиеДанные;
		ТекДанные.Квалификация = ВыбранноеЗначение;
		ТекущаяОсновная = торо_ПроцедурыУправленияПерсоналом.ПолучитьОсновнуюКвалификацию(ТекДанные.Сотрудник, Объект.Ссылка);
		
		Если ВыбранноеЗначение = ТекущаяОсновная Тогда
			ТекДанные.Основная = Истина;
			Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.ПрисвоениеКвалификаций") Тогда
				ТекДанные.НоваяОсновная = ТекущаяОсновная;
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций") Тогда
			МассивСтрок = Объект.КвалификацииСотрудников.НайтиСтроки(Новый Структура("НоваяОсновная, Сотрудник", ВыбранноеЗначение, ТекДанные.Сотрудник));
			Для Каждого Строка ИЗ МассивСтрок Цикл
				Строка.НоваяОсновная = ПредопределенноеЗначение("Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка");
			КонецЦикла;
		КонецЕсли;
	Конецесли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
    УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УстановитьВнешнийВидФормы()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийСКвалификациями.ПрисвоениеКвалификаций") Тогда
		Элементы.КвалификацииСотрудниковКвалификация.Заголовок = НСтр("ru = 'Присваиваемая квалификация'");
		Элементы.КвалификацииСотрудниковКвалификация.РежимВыбораИзСписка = Ложь;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаСпискаВыбора = Ложь;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаВыбора = Истина;
		Элементы.КвалификацииСотрудниковОсновная.Доступность = Истина;
		Элементы.КвалификацииСотрудниковНоваяОсновная.Заголовок = НСтр("ru = 'Текущая основная'");
		Элементы.КвалификацииСотрудниковНоваяОсновная.Доступность = Ложь;
	Иначе
		Элементы.КвалификацииСотрудниковКвалификация.Заголовок = НСтр("ru = 'Удаляемая квалификация'");
		Элементы.КвалификацииСотрудниковКвалификация.РежимВыбораИзСписка = Истина;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаСпискаВыбора = Истина;
		Элементы.КвалификацииСотрудниковКвалификация.КнопкаВыбора = Ложь;
		Элементы.КвалификацииСотрудниковОсновная.Доступность = Ложь;
		Элементы.КвалификацииСотрудниковНоваяОсновная.Заголовок = НСтр("ru = 'Новая основная'");
		Элементы.КвалификацииСотрудниковНоваяОсновная.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		ОткрытьФорму("Справочник.Организации.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти