
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСтатусов.ЗагрузитьЗначения(Параметры.СписокСледующихСтатусов.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныйСтатус = Неопределено;
	Если СписокСтатусов.Количество() = 1 Тогда
		ВыбранныйСтатус = СписокСтатусов[0].Значение;
	Иначе
		ТекущиеДанные = Элементы.СписокСтатусов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ВыбранныйСтатус = ТекущиеДанные.Значение;
		КонецЕсли;;
	КонецЕсли;
	
	Если ВыбранныйСтатус = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран статус!");
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ВыбранныйСтатус, Комментарий", ВыбранныйСтатус, Комментарий));
	
КонецПроцедуры

#КонецОбласти