#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОчиститьТабЧасть") И НЕ Параметры.ОчиститьТабЧасть = Неопределено И Параметры.ОчиститьТабЧасть Тогда
		Объект.ПричиныВозникновенияДефекта.Очистить();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры
#КонецОбласти