#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
	
	Если КвалификацииСотрудников.Количество() = 0 Тогда
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе не заполнена табличная часть квалификаций сотрудников. Проведение невозможно!'"));
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = Строка(Ссылка);
	
	Если Не Отказ Тогда
		
		Если ВидОперации = Перечисления.торо_ВидыОперацийСКвалификациями.УдалениеКвалификаций Тогда
			
			Для Каждого СтрокаТЧ Из КвалификацииСотрудников Цикл
				
				// регистр торо_КвалификацияРемонтногоПерсонала 
				Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
				Движение.Период       = Дата;
				Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
				Движение.Квалификация = СтрокаТЧ.Квалификация;
				Движение.Удаленная 	  = Истина;
				
				// Перевыбор основной квалификации
				Если ЗначениеЗаполнено(СтрокаТЧ.НоваяОсновная) Тогда
					
					Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
					Движение.Период       = Дата;
					Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
					Движение.Квалификация = СтрокаТЧ.НоваяОсновная;
					Движение.Основная 	  = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаТЧ Из КвалификацииСотрудников Цикл
			
				// регистр торо_КвалификацияРемонтногоПерсонала 
				Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
				Движение.Период       = Дата;
				Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
				Движение.Квалификация = СтрокаТЧ.Квалификация;
				Движение.Основная = СтрокаТЧ.Основная;
				
				Если СтрокаТЧ.Основная И ЗначениеЗаполнено(СтрокаТЧ.НоваяОсновная)
					И СтрокаТЧ.Квалификация <> СтрокаТЧ.НоваяОсновная Тогда
					Движение = Движения.торо_КвалификацияРемонтногоПерсонала.Добавить();
					Движение.Период       = Дата;
					Движение.Сотрудник    = СтрокаТЧ.Сотрудник;
					Движение.Квалификация = СтрокаТЧ.НоваяОсновная;
					Движение.Основная = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Движения.торо_КвалификацияРемонтногоПерсонала.Записать();
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#КонецЕсли