#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
	Если ПроверитьПравоНаКлиенте("Редактирование") Тогда
		Если ЭтаФорма.Элементы.Найти("СписокОбъектов") <> Неопределено
				и ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СписокОбъектов Тогда
			СтруктураСдвига = торо_НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(ЭтаФорма.СписокОбъектов, ЭтаФорма.Элементы.СписокОбъектов, ЭтаФорма.ТекСтруктураИерархии);
		Иначе
			СтруктураСдвига = торо_НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(ЭтаФорма.Дерево, ЭтаФорма.Элементы.Дерево, ЭтаФорма.ТекСтруктураИерархии);
		КонецЕсли;
		торо_НастройкаПорядкаЭлементовКлиент.ВыполнитьСдвигЭлементаНаФорме(ЭтаФорма, "Дерево", "СписокОбъектов", СтруктураСдвига);
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Нарушение прав доступа!'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Функция ПроверитьПравоНаКлиенте(Право)
	
	Возврат торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво(Право,"Справочники","торо_ОбъектыРемонта");	
	
КонецФункции

#КонецОбласти