
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	
	Если Операции.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 не заполнена табличная часть операций. Проведение невозможно!'"), Ссылка);
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		
	КонецЕсли;
	// регистр торо_ЗапланированныеПодрядчикиРемонтов
	
	Движения.торо_ЗапланированныеПодрядчикиРемонтов.Записывать = Истина;

	Для Каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.торо_ЗапланированныеПодрядчикиРемонтов.Добавить();
		Движение.Период            = Дата;
		Движение.ID                = ТекСтрокаОперации.ID;
		Движение.Подрядчик         = Подрядчик;
		Движение.ДоговорПодрядчика = Договор;
	КонецЦикла;

	
КонецПроцедуры
#КонецОбласти

#КонецЕсли