
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьКомандыТегов();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура кнДобавитьТегНажатие(Команда)
	
	Если ЭтаФорма.ТекущийЭлемент = Элементы.ТемаПисьма
		Или ЭтаФорма.ТекущийЭлемент = Элементы.ТелоПисьма Тогда
		
		ИмяТега = "%" + Команда.Имя + "%";
		ЭтаФорма.ТекущийЭлемент.ВыделенныйТекст = ИмяТега;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДобавитьКомандыТегов()
	
	// Номер
	ДобавитьКоманду("Номер"                           , Элементы.ГруппаДокументы);
	// Дата
	ДобавитьКоманду("Дата"                            , Элементы.ГруппаДокументы);
	// Ответственный
	ДобавитьКоманду("Ответственный"                   , Элементы.ГруппаДокументы);
	// Согасование
	// Согласующий
	ДобавитьКоманду ("Согласующий"                    , Элементы.ГруппаСогласование);
	ДобавитьКоманду ("СтатусДокумента"                , Элементы.ГруппаСогласование);
	ДобавитьКоманду ("ПредыдущийСтатусДокумента"      , Элементы.ГруппаСогласование);
	
	ДобавитьКоманду ("ОбъектРемонта"				  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("Показатель"					  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("ЗначениеПоказателя"			  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("ЕдиницаИзмеренияПоказателя" 	  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("УсловиеУведомления" 			  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("Значение" 					  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("ГраницаИнтервала" 			  , Элементы.ГруппаКонтролируемыеПоказатели);
	ДобавитьКоманду ("КритическиеЗначенияПоказателей" , Элементы.ГруппаКонтролируемыеПоказатели);
	
	ДобавитьКоманду ("Адресат"                        , Элементы.ГруппаОбщие);
	
	ДобавитьКоманду ("ВидДефекта"                     , Элементы.ГруппаВыявленныеДефекты);
	ДобавитьКоманду ("ДефектныеОбъектыРемонта"        , Элементы.ГруппаВыявленныеДефекты);

КонецПроцедуры

&НаСервере
Процедура ДобавитьКоманду (ИмяКоманды, Группа)
	НовКнопкаМеню = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Группа);
	НовКнопкаМеню.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовКнопкаМеню.Заголовок  = "%" + ИмяКоманды + "%";

	НовКоманда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	НовКоманда.Действие      = "кнДобавитьТегНажатие";
	НовКоманда.Заголовок     = "%"+ ИмяКоманды +"%";
	
	НовКнопкаМеню.ИмяКоманды = ИмяКоманды;	
КонецПроцедуры

#КонецОбласти
