////////////////////////////////////////////////////////////////////////////////
// торо_ОбщегоНазначенияВызовСервера: общие методы
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Проверяет, что открыто несколько сеансов у этого пользователя.
// Возвращаемое значение:
//		Булево - открыто несколько сеансов.
Функция ПроверитьОткрытиеНесколькихСеансов() Экспорт
	
	Возврат торо_ОбщегоНазначения.ПроверитьОткрытиеНесколькихСеансов();
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ЛюбаяСсылка - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка - например, "Код".
// 
// Возвращаемое значение:
//  Произвольный - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

// Обертка к платформенной функции ПравоДоступа.
// Параметры:
//		Право - Строка - название права доступа.
//		ТипОбъектаМетаданных - Строка - название типа "Справочники", "Документы" и т.п.
//		ИмяОбъекта - Строка - название конкретного справочника или документа.
//
// Возвращаемое значение:
//		Булево - Истина, если право есть.
Функция ЕстьПраво(Право,ТипОбъектаМетаданных,ИмяОбъекта) Экспорт
	Возврат ПравоДоступа(Право, Метаданные[ТипОбъектаМетаданных][ИмяОбъекта])
КонецФункции

// Функция проверят наличие ролей с префиксом "торо", если отсутствует роль "Базовые права ТОиР".
// Возвращаемое значение:
//		Булево - доступна ли роль.
Функция ДоступностьРолиТОиРБазовыеПрава() Экспорт
	Возврат торо_ОбщегоНазначения.ДоступностьРолиТОиРБазовыеПрава();	
КонецФункции

// Проверяет право доступа на конфигурацию в целом.
// Параметры:
//		Право - Строка - проверяемое право.
// Возвращаемое значение:
//		Булево - есть ли право.
Функция ЕстьПравоУКонфигурации(Право) Экспорт
	Возврат ПравоДоступа(Право, Метаданные)
КонецФункции

#КонецОбласти
