////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ОбменТОиР20УПП_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
КонецПроцедуры

Процедура ОбменТОиР20УПП_ЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменТОиР20УПП", Источник, Отказ , РежимЗаписи, РежимПроведения);
	
	УзелДляОтправки = ОбменДаннымиПовтИсп.ПолучитьУзелДляРегистрцииИзменений("ОбменТОиР20УПП");
	Если УзелДляОтправки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		НоваяСсылка = Документы[Источник.Метаданные().Имя].ПолучитьСсылку();
		Источник.УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	ПланыОбмена.ЗарегистрироватьИзменения(УзелДляОтправки, Источник);
КонецПроцедуры

Процедура ОбменТОиР20УПП_ЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменТОиР20УПП", Источник, Отказ,Замещение);
КонецПроцедуры

#КонецОбласти
