
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВариантОтображенияПоУмолчанию <> Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипДиаграммы");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ВариантОтображенияПоУмолчанию <> Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
		ТипДиаграммы = Неопределено;
	КонецЕсли;
	
	Если ВыбратьСортировку <> Перечисления.торо_ВариантыСортировки.Лучшие
		И ВыбратьСортировку <> Перечисления.торо_ВариантыСортировки.Худшие Тогда
		КоличествоВыбираемыхЭлементов = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИДПоставляемойМодели = "";
	
КонецПроцедуры

#КонецОбласти