////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетКлиент: методы кадрового учета, работающие на стороне клиента.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму подбора значений из классификатора
//
// Параметры:
//			ИмяСправочника - Строка - имя справочника как оно задано в конфигураторе
//  		ПолныйПутьКМакету - Строка - формат полного пути:
//								"Документ.<ИмяДокумента>.<ИмяМакета>"
//								"Обработка.<ИмяОбработки>.<ИмяМакета>"
//								"ОбщийМакет.<ИмяМакета>"
//			Заголовок - Строка - заголовок формы.
//			Форма - УправляемаяФорма - форма.
//			СоответствиеПолей - Соответствие - задает соответствие имен реквизитов справочника\
//							именам полей классификатора.
//
Процедура ОткрытьФормуПодбораИзКлассификатора(ИмяСправочника, ПолныйПутьКМакету, Заголовок, Форма, СоответствиеПолей = Неопределено) Экспорт
	
	СтруктураПараметров = Новый Структура("ИмяСправочника,ПолныйПутьКМакету,Заголовок",
		ИмяСправочника,
		ПолныйПутьКМакету,
		Заголовок);
		
	Если СоответствиеПолей <> Неопределено Тогда
		СтруктураПараметров.Вставить("СоответствиеПолей", СоответствиеПолей);
	КонецЕсли; 
	
	ДопПараметры = Новый Структура("Форма", Форма);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуПодбораИзКлассификатораЗавершение", КадровыйУчетКлиент, ДопПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ЗаполнениеСправочниковИзКлассификаторов", СтруктураПараметров, Форма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции  

Процедура ОповеститьОбИзмененииРабочегоМеста(Форма) Экспорт
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ФизическоеЛицо", Форма.Объект.ФизическоеЛицо);
	ПараметрыОповещения.Вставить("Сотрудник", Форма.Объект.Сотрудник);
	
	Оповестить("ИзменениеДанныхМестаРаботы", ПараметрыОповещения, Форма);
	
КонецПроцедуры

Процедура ОткрытьФормуПодбораИзКлассификатораЗавершение(Результат, ДопПараметры) Экспорт
	ДопПараметры.Форма.Элементы.Список.Обновить();
КонецПроцедуры
 
#КонецОбласти
