
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьСоставное(Команда)
	ФормаКонструктора = ПолучитьФорму( "Справочник.торо_НаправленияОбъектовРемонтныхРабот.Форма.ФормаКонструктораНаправлений",,,,ВариантОткрытияОкна.ОтдельноеОкно );
	ФормаКонструктора.Открыть();
КонецПроцедуры
#КонецОбласти