#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Проверяет могут ли переданные характеристика и упавка являться характеристикой и упаковой переданной
// номенклатуры. При проверке учитывается, что характеристики могут быть общими для вида номенклатуры,
// а упаковки общими для набора упаковок.
//
//		Параметры:
//			Номенклатура - СправочникСсылка.Номенклатура - номенклатура-владелец характеристик и упаковок,
//			Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - проверяемая характеристика,
//			Упаковка - СправочникСсылка.Упаковка - проверяемая упаковка.
//
//		Возвращаемое значение:
//			Структура - стуктура с полями
//				Характеристика - если проверяемая характеристика подходит, то записывается она, если нет - пустая ссылка,
//				Упаковка - если провуеряемая упаковка подходит, то записывается она, если нет - пустая ссылка,
//				ХарактеристикиИспользуются - равно ИСТИНА, если по номенклатуре ведется учет характеристик.
//
Функция ХарактеристикаИУпаковкаПринаджлежатВладельцу(Номенклатура, Характеристика, Упаковка) Экспорт
	
	СтруктураВозврата = Новый Структура("Характеристика, Упаковка, ХарактеристикиИспользуются");
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		СтруктураВозврата.Характеристика             = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		СтруктураВозврата.Упаковка                   = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		СтруктураВозврата.ХарактеристикиИспользуются = Ложь;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(СпрУпаковки.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК Упаковка,
	|	ЕСТЬNULL(СпрХарактеристики.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|			ИЛИ СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХарактеристикиИспользуются
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристики
	|		ПО (ВЫБОР
	|				КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|					ТОГДА СпрНоменклатура.ВидНоменклатуры
	|				КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|					ТОГДА СпрНоменклатура.Ссылка
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ = СпрХарактеристики.Владелец)
	|			И (СпрХарактеристики.Ссылка = &Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК СпрУпаковки
	|		ПО (СпрНоменклатура.Ссылка = СпрУпаковки.Владелец)
	|			И (СпрУпаковки.Ссылка = &Упаковка)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
    Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
	
	Возврат СтруктураВозврата;

КонецФункции

// Функция - Неиспользуемые для контроля заполнения и отборов реквизиты
// Возвращаемое значение:
//  Массив - Внутри строки с именами реквизитов.
Функция НеиспользуемыеДляКонтроляЗаполненияИОтборовРеквизиты() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ФайлКартинки");
	Результат.Добавить("ФайлОписанияДляСайта");
	Результат.Добавить("НаборУпаковок");
	Результат.Добавить("ШаблонЦенника");
	Результат.Добавить("ШаблонЭтикетки");
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизитов номеклатуры, если номенклатура не передана - возвращаются значения по умолчанию.
//
//	Параметры:
//		Номенклатура - СправочникСсылка.Номенклатура - номенклатура, чьи реквизиты нужно вернуть.
//	Возвращаемое значение:
//		Структура - поля ВестиУчетПоГТД, ЕдиницаИзмерения, СтавкаНДС, ГруппаФинансовогоУчета, ПодакцизныйТовар, ЭтоУслуга.
//
Функция ЗначенияРеквизитовНоменклатуры(Номенклатура) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР КОГДА Номенклатура.ТипНоменклатуры НЕ В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|");
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВестиУчетПоГТД = Ложь;
		СтавкаНДС = Выборка.СтавкаНДС;
		ЭтоУслуга = Выборка.ЭтоУслуга;
		ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		ГруппаФинансовогоУчета = Неопределено;
		ПодакцизныйТовар = Ложь;
	Иначе
		ВестиУчетПоГТД = Ложь;
		СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		ЭтоУслуга = Неопределено;
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		ГруппаФинансовогоУчета = Неопределено;
		ПодакцизныйТовар = Ложь;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("ВестиУчетПоГТД, СтавкаНДС, ЭтоУслуга, ЕдиницаИзмерения, ГруппаФинансовогоУчета, ПодакцизныйТовар",
		ВестиУчетПоГТД,
		СтавкаНДС,
		ЭтоУслуга,
		ЕдиницаИзмерения,
		ГруппаФинансовогоУчета,
		ПодакцизныйТовар);
	
	Возврат СтруктураРеквизитов;

КонецФункции // ЗначенияРеквизитовНоменклатуры()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Карточка номенклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КарточкаНоменклатуры";
	КомандаПечати.Представление = НСтр("ru = 'Карточка номенклатуры'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Карточка номенклатуры'");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПредставлениями

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.Номенклатура");
	Если ФорматнаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	СписокПолей = торо_РаботаСПользовательскимПредставлением.ПолучитьСписокПолей(ФорматнаяСтрока);
	
	Для Каждого Поле Из СписокПолей Цикл
		
		Поля.Добавить(Поле);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.Номенклатура");
	Если ФорматнаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	Представление = торо_РаботаСПользовательскимПредставлением.ПолучитьПредставлениеПоФорматнойСтроке(ФорматнаяСтрока,Данные);
	
КонецПроцедуры

// Функция - заполняет список реквизитов, которые можно использовать при формировании форматной строки в конструкторе.
//
// Параметры:
//  СписокРеквизитов - СписокЗначений - пустой список значений для заполнения.
Процедура ЗаполнитьСписокРеквизитовДляФорматнойСтроки(СписокРеквизитов) Экспорт
	
	СписокРеквизитов.Добавить("Наименование",		"Наименование");
	СписокРеквизитов.Добавить("НаименованиеПолное",	"Полное наименование");
	СписокРеквизитов.Добавить("ВидНоменклатуры",	"Вид номенклатуры");
	СписокРеквизитов.Добавить("Артикул",			"Артикул");
	СписокРеквизитов.Добавить("ТипНоменклатуры",	"ТипНоменклатуры");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КарточкаНоменклатуры") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"КарточкаНоменклатуры", 
			НСтр("ru = 'Карточка номенклатуры'"), 
			СформироватьПечатнуюФормуКарточкиНоменклатуры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП.
//	Возвращаемое значение:
//		Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ВидНоменклатуры");
	Результат.Добавить("СтавкаНДС");
	Результат.Добавить("ЕдиницаИзмерения");
	
	Возврат Результат;

КонецФункции

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Возвращает имена реквизитов, которые не должны отображаться в списке реквизитов обработки ГрупповоеИзменениеОбъектов.
//
//	Возвращаемое значение:
//		Массив - массив имен реквизитов.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	НеРедактируемыеРеквизиты.Добавить("ВидНоменклатуры");
	НеРедактируемыеРеквизиты.Добавить("ИспользованиеХарактеристик");
	НеРедактируемыеРеквизиты.Добавить("НаименованиеПолное");
	НеРедактируемыеРеквизиты.Добавить("Описание");
	НеРедактируемыеРеквизиты.Добавить("ТипНоменклатуры");
	НеРедактируемыеРеквизиты.Добавить("ФайлКартинки");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

#Область Печать

Функция ПолучитьДанныеДляПечатнойФормыКарточкаНоменклатуры(МассивОбъектов, ПараметрыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.НаименованиеПолное КАК ТекстЗаголовка,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Номенклатура.Производитель КАК Производитель,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.Описание КАК Описание,
	|	Номенклатура.ФайлКартинки.Ссылка КАК КартинкаНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.НаименованиеПолное КАК НаименованиеХарактеристики
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО ХарактеристикиНоменклатуры.Владелец = ВТНоменклатура.Ссылка
	|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.НаименованиеПолное
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО ХарактеристикиНоменклатуры.Владелец = ВТНоменклатура.ВидНоменклатуры
	|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеХарактеристики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Представление КАК НаименованиеУпаковки
	|ИЗ
	|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО УпаковкиНоменклатуры.Владелец = ВТНоменклатура.Ссылка
	|			И (НЕ УпаковкиНоменклатуры.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Свойство,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ДополнительныеРеквизиты КАК ВидыНоменклатурыРеквизитыБыстрогоОтбораНоменклатуры
	|		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВидыНоменклатурыРеквизитыБыстрогоОтбораНоменклатуры.Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", 			ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоХарактеристикам", ПакетРезультатовЗапроса[2]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоУпаковкам", 		ПакетРезультатовЗапроса[3]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоДопРеквизитам", 	ПакетРезультатовЗапроса[4]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументКарточкаНоменклатуры(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеПечатиХарактеристики = ДанныеДляПечати.РезультатПоХарактеристикам.Выгрузить();
	ДанныеПечатиУпаковки = ДанныеДляПечати.РезультатПоУпаковкам.Выгрузить();
	ДанныеПечатиДопРеквизиты = ДанныеДляПечати.РезультатПоДопРеквизитам.Выгрузить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Номенклатура.ПФ_MXL_КарточкаНоменклатуры");
	
	ОбластьПараметровТемная  = Макет.ПолучитьОбласть("ОбластьПараметровТемная");
	ОбластьПараметровСветлая = Макет.ПолучитьОбласть("ОбластьПараметровСветлая");
	
	ПерваяКарточка = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если ПерваяКарточка Тогда
			ПерваяКарточка = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПорядокПараметра = 1;
		
		// Вывод шапки
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывод основных реквизитов номенклатуры
		Если ЗначениеЗаполнено(ДанныеПечати.Код) Тогда
			
			ОбластьМакета = ?(ПорядокПараметра%2 = 0, ОбластьПараметровТемная, ОбластьПараметровСветлая);
			СтруктураПараметровМакета = Новый Структура;
			СтруктураПараметровМакета.Вставить("ИмяПараметра", НСтр("ru='Код:'"));
			СтруктураПараметровМакета.Вставить("ЗначениеПараметра", ДанныеПечати.Код);
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
			ОбластьЯчеек = ТабличныйДокумент.Вывести(ОбластьМакета);
			ПорядокПараметра = ПорядокПараметра + 1;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПечати.Артикул) Тогда
			
			ОбластьМакета = ?(ПорядокПараметра%2 = 0, ОбластьПараметровТемная, ОбластьПараметровСветлая);
			СтруктураПараметровМакета = Новый Структура;
			СтруктураПараметровМакета.Вставить("ИмяПараметра", НСтр("ru='Артикул:'"));
			СтруктураПараметровМакета.Вставить("ЗначениеПараметра", ДанныеПечати.Артикул);
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
			ОбластьЯчеек = ТабличныйДокумент.Вывести(ОбластьМакета);
			ПорядокПараметра = ПорядокПараметра + 1;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПечати.ТипНоменклатуры) Тогда
			Если ДанныеПечати.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга 
				ИЛИ ДанныеПечати.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				
				ОбластьМакета = ?(ПорядокПараметра%2 = 0, ОбластьПараметровТемная, ОбластьПараметровСветлая);
				СтруктураПараметровМакета = Новый Структура;
				СтруктураПараметровМакета.Вставить("ИмяПараметра", НСтр("ru='Тип:'"));
				СтруктураПараметровМакета.Вставить("ЗначениеПараметра", НСтр("ru='Услуга'"));
				ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				ПорядокПараметра = ПорядокПараметра + 1;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПечати.Производитель) Тогда
			
			ОбластьМакета = ?(ПорядокПараметра%2 = 0, ОбластьПараметровТемная, ОбластьПараметровСветлая);
			СтруктураПараметровМакета = Новый Структура;
			СтруктураПараметровМакета.Вставить("ИмяПараметра", НСтр("ru='Производитель:'"));
			СтруктураПараметровМакета.Вставить("ЗначениеПараметра", ДанныеПечати.Производитель);
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ПорядокПараметра = ПорядокПараметра + 1;
			
		КонецЕсли;
				
		Если ЗначениеЗаполнено(ДанныеПечати.ЕдиницаИзмерения) Тогда
			
			ОбластьМакета = ?(ПорядокПараметра%2 = 0, ОбластьПараметровТемная, ОбластьПараметровСветлая);
			СтруктураПараметровМакета = Новый Структура;
			СтруктураПараметровМакета.Вставить("ИмяПараметра", НСтр("ru='Единица измерения:'"));
			СтруктураПараметровМакета.Вставить("ЗначениеПараметра", ДанныеПечати.ЕдиницаИзмерения);
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ПорядокПараметра = ПорядокПараметра + 1;
			
		КонецЕсли;
				
		// Вывод дополнительных реквизитов
		Если ДанныеПечатиДопРеквизиты.Количество() <> 0 Тогда
			Для каждого РеквизитОтбора Из ДанныеПечатиДопРеквизиты Цикл
				
				ОбластьМакета = ?(ПорядокПараметра%2 = 0, ОбластьПараметровТемная, ОбластьПараметровСветлая);
				СтруктураПараметровМакета = Новый Структура;
				СтруктураПараметровМакета.Вставить("ИмяПараметра", Строка(РеквизитОтбора.Свойство) + ":");
				СтруктураПараметровМакета.Вставить("ЗначениеПараметра", РеквизитОтбора.Значение);
				ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				ПорядокПараметра = ПорядокПараметра + 1;
				
			КонецЦикла;
		КонецЕсли;
		
		// Вывод картинки
		Если ЗначениеЗаполнено(ДанныеПечати.КартинкаНоменклатуры) Тогда
			КартинкаНоменклатуры = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ДанныеПечати.КартинкаНоменклатуры);
			
			Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
			Рисунок.Верх = 15; 
			Рисунок.Высота = 75; 
			Рисунок.Ширина = 75; 
			Рисунок.Лево = 100; 
			Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
			
			Если ТипЗнч(КартинкаНоменклатуры) = Тип("Картинка") Тогда
				Рисунок.Картинка = КартинкаНоменклатуры;
			ИначеЕсли ТипЗнч(КартинкаНоменклатуры) = Тип("ДвоичныеДанные") Тогда
				Рисунок.Картинка = Новый Картинка(КартинкаНоменклатуры);
			КонецЕсли; 
		КонецЕсли;
		
		// Вывод описания
		Если ЗначениеЗаполнено(ДанныеПечати.Описание) Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОписание");
			СтруктураПараметровМакета = Новый Структура;
			СтруктураПараметровМакета.Вставить("Описание", ДанныеПечати.Описание);
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		// Вывод характеристик
		Если ДанныеПечатиХарактеристики.Количество() <> 0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьХарактеристики");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Для каждого Характеристика из ДанныеПечатиХарактеристики Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаХарактеристики");
				СтруктураПараметровМакета = Новый Структура;
				СтруктураПараметровМакета.Вставить("НаименованиеХарактеристики", " • " + Характеристика.НаименованиеХарактеристики);
				ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
		
		// Вывод упаковок
		Если ДанныеПечатиУпаковки.Количество() <> 0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьУпаковки");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Для каждого Упаковка из ДанныеПечатиУпаковки Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаУпаковки");
				СтруктураПараметровМакета = Новый Структура;
				СтруктураПараметровМакета.Вставить("НаименованиеУпаковки", " • " + Упаковка.НаименованиеУпаковки);
				ОбластьМакета.Параметры.Заполнить(СтруктураПараметровМакета);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуКарточкиНоменклатуры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КАРТОЧКАНОМЕНКЛАТУРЫ";
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыКарточкаНоменклатуры(МассивОбъектов, ПараметрыПечати);
	ЗаполнитьТабличныйДокументКарточкаНоменклатуры(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	УстановитьПривилегированныйРежим(Ложь);
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли