////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление доступом".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Виды доступа Пользователи и ВнешниеПользователи уже заполнены.
// Их можно удалить, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Подразделения";
	ВидДоступа.Представление = "Подразделения";
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.СтруктураПредприятия");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ОбъектыРемонта";
	ВидДоступа.Представление = "Объекты ремонта";
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.торо_ОбъектыРемонта");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - массив структур, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - структура со свойствами:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ДобавитьПрофильТОиР(ОписанияПрофилей);
	
	ДобавитьПрофильОператора(ОписанияПрофилей);
	ДобавитьПрофильДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильМеханика(ОписанияПрофилей);
	ДобавитьПрофильИнженера(ОписанияПрофилей);		
	ДобавитьПрофильУтверждениеНормативов(ОписанияПрофилей);
	ДобавитьПрофильАнализЭффективности(ОписанияПрофилей);
	
КонецПроцедуры

//// Служебная фунция. Сделана экспортной для удобства внедренцев.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	// Запуск 1С:Предприятия
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
		
	// Задачи и задания
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	
	// Заметки и напоминания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	// Документооборот
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	
	// Электронная подпись
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Файлы и папки файлов
	ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
	
	// Дополнительные сведения
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
	// Редактирование реквизитов объектов
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	
	// Использование дополнительных отчетов и обработок
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Рассылки отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");	
		
	// Базовая НСИ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	// ТОиР
	ОписаниеПрофиля.Роли.Добавить("торо_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗащитыУправленияРемонтами82");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПанелиАдминистрированияТОиР");	
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПользовательскихНастроек");
	
	ОписаниеПрофиля.Роли.Добавить("торо_РазделИнтеграцияС1СДокументооборотом");	
	
	// Раздел подсистем
	ОписаниеПрофиля.Роли.Добавить("торо_РазделИнтеграцияС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделМТО");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНастройкаИАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформацияНоменклатура");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформацияПредприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформацияРаботаСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделПланированиеТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУправлениеНарядамиИРаботами");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУправлениеПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУчетОборудованияИНормативов");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУчетПоказателейЭксплуатации");

	
КонецПроцедуры

Процедура ДобавитьПрофильТОиР(ОписанияПрофилей)
	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "БазовыеПраваТОиР";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Базовые права ТОиР'");
	ОписаниеПрофиля.Идентификатор = "ab8ca17c-8df7-4c6f-a6ba-6dfb85a2d469";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- просмотра данных информационной системы.'");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);	
//	
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаЭксплуатацииДляВводаНаОснованииВыявленногоДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------1---------------------------------1
////
Процедура ДобавитьПрофильОператора(ОписанияПрофилей)
	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "Оператор";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор'");
	ОписаниеПрофиля.Идентификатор = "6c707460-f5fe-4cb2-bec1-ac7481e2258b";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- учета наработки объектов ремонта,
				|- учета контролируемых показателей,
				|- учета состояний объектов ремонта.'");

	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
//	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры


//// -----------2---------------------------------2
////
Процедура ДобавитьПрофильДиспетчера(ОписанияПрофилей)
//	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();

	ОписаниеПрофиля.Имя = "Диспетчер";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Диспетчер'");
	ОписаниеПрофиля.Идентификатор = "43f2f015-280b-4546-8731-3b399b49049a";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- регистрации дефектов объектов ремонта,
				|- учета состояний объектов ремонта,
				|- оформления заявок на ремонт.'");	
	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	//ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	//ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	//ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	//ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	//ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланВнепленРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования"); 	
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссий");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//	
КонецПроцедуры

// -----------3---------------------------------3
//
Процедура ДобавитьПрофильМеханика(ОписанияПрофилей)
//	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();	
	
	ОписаниеПрофиля.Имя = "Механик";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Механик'");
	ОписаниеПрофиля.Идентификатор = "5aa39e65-c646-4ba3-b56a-b65fd753a3bf";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- оформления заявок на ремонт.'");   
	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
//	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");

	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");

	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланВнепленРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");

	
	//Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------4---------------------------------4
////   
Процедура ДобавитьПрофильИнженера(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "Инженер";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Инженер'");
	ОписаниеПрофиля.Идентификатор = "36bc60d8-a5aa-4d98-b4d7-15eab6d88494";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- учета объектов ремонта;
				|- планирования ППР, регламентных мероприятий;
				|- учета выполненных работ.'");

	
	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеОстановочныхРемонтов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");
	
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");
	
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКорректировокППРПоРМ");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеУстановкиОценкиРМПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВалютыРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИерархииДляВводаНовыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияПриоритетностиПеренесенныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланВнепленРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКалькулятораРЦ");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаКоличестваДнейСмещенияВДефектеДляПростоев");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	
	// Согласования и  уведомления
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДокументовУведомлений");
	
	//Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");

	 	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------5---------------------------------5
////
Процедура ДобавитьПрофильУтверждениеНормативов(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Утверждение нормативов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "УтверждениеНормативов";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Нормативы и НСИ'");
	ОписаниеПрофиля.Идентификатор = "349c7ae2-0474-11e5-bf1f-8eb2736043cf";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- учета нормативов;
				|- учета НСИ.'");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеТехнологическихКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеТиповыхОР");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДоговорыКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаГрафикаРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтактныхЛицПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияКонтактныхЛицПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрисоединенныхКНоменклатуреФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПрисоединенныхКНоменклатуреФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДолжностей");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------6---------------------------------5
////
Процедура ДобавитьПрофильАнализЭффективности(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Утверждение нормативов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "АнализЭффективности";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Анализ эффективности'");
	ОписаниеПрофиля.Идентификатор = "cde10382-4b4c-4a32-a7d7-1f50a9c0997e";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- просмотра отчетов.'");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаЦелевыхЗначенийПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановкаЦелевыхЗначенийПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПросмотрУниверсальныйОтчетПоПоказателямKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПросмотрПанельОтчетов");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделПоказателиKPI");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	//ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланВнепленРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("ОтчетВедомостьПоТоварамНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	 	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект":
// 1) стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта
//    и проверяется отсутствие ограничения чтения "ведущего" объекта;
// 2) стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта
//    и проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным:
// в пункте "2)" вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например, Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например, Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов, указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками, описание которых см. в комментарии
//                   к функции РегистрыСведений.НастройкиПравОбъектов.ВозможныеПрава().
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
//  Вызывается из процедур:
// УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа().
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
