////////////////////////////////////////////////////////////////////////////////
// торо_РаботаСУведомлениямиГлобальный: методы, для работы с уведомлениями и оповещениями.
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
Процедура ПоказатьВсплывающиеСообщения() Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	МассивУведомлений = торо_РаботаСУведомлениями.ПолучитьНеСформированныеУведомления(ПредопределенноеЗначение("Перечисление.торо_СпособыУведомленияПользователей.УведомлениеВВидеВсплывающейПодсказки"),ТекущийПользователь);
	
	Для Каждого Уведомление из МассивУведомлений Цикл
		
		ПоказатьОповещениеПользователя(Уведомление.ТемаПисьма, ?(ЗначениеЗаполнено(Уведомление.Источник), ПолучитьНавигационнуюСсылку(Уведомление.Источник), ""),Уведомление.ТелоПисьма);
		
	КонецЦикла;
	
	торо_РаботаСУведомлениями.ОтметитьУведомленияПользователя(МассивУведомлений);
	
КонецПроцедуры
#КонецОбласти


