////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетРасширенныйВызовСервера: методы кадрового учета, работающие на  стороне сервера,
// 		вызываемые со стороны клиента. 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает кадровые данные сотрудника.
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники - сотрудник.
//  КадровыеДанные - Строка - список запрашиваемых кадровых данных через запятую.
//  Период - Дата - период среза.
// Возвращаемое значение:
//  ФиксированнаяСтруктура - кадровые данные.
Функция КадровыеДанныеСотрудника(Сотрудник, КадровыеДанные, Период) Экспорт
	СтруктураВозврата = Новый Структура("Период,Сотрудник," + КадровыеДанные, Период, Сотрудник);
	МассивКадровыхДанных = КадровыеДанныеСотрудников(Сотрудник, КадровыеДанные, Период);
	Если МассивКадровыхДанных.Количество() > 0 Тогда
		Возврат МассивКадровыхДанных[0];
	КонецЕсли;
	Возврат Новый ФиксированнаяСтруктура(СтруктураВозврата);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресДанныхОЗанятыхПозицияхСотрудниковПриПеремещенииВДругоеПодразделение(СоответствиеСотрудников) Экспорт
	Возврат КадровыйУчетРасширенный.АдресДанныхОЗанятыхПозицияхСотрудниковПриПеремещенииВДругоеПодразделение(СоответствиеСотрудников);
КонецФункции

Функция КадровыеДанныеСотрудников(Сотрудники, КадровыеДанные, Период)
	ВозвращаемыйМассив = Новый Массив;
	ТаблицаКадровыхДанных = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, Сотрудники, КадровыеДанные, Период);
	Для каждого СтрокаТаблицаКадровыхДанных Из ТаблицаКадровыхДанных Цикл
		СтруктураВозврата = Новый Структура("Период,Сотрудник," + КадровыеДанные, Период);
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтрокаТаблицаКадровыхДанных);
		ВозвращаемыйМассив.Добавить(Новый ФиксированнаяСтруктура(СтруктураВозврата));
	КонецЦикла;
	Возврат Новый ФиксированныйМассив(ВозвращаемыйМассив);
КонецФункции

#КонецОбласти