
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоПравамПользвателя();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоПравамПользвателя()
	
	СоответствиеЭлементов = Новый Соответствие;
	СоответствиеЭлементов.Вставить("ГруппаВидыОценок", Метаданные.Справочники.торо_ВидыОценок);
	СоответствиеЭлементов.Вставить("ГруппаКритерииОценки", Метаданные.Справочники.торо_КритерииОценки);
	
	Для каждого КлючИЗначение из СоответствиеЭлементов Цикл
		Если НЕ ПравоДоступа("Просмотр", КлючИЗначение.Значение) И Элементы.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			Элементы[КлючИЗначение.Ключ].Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВидыОценок(Команда)
	
	ОткрытьФорму("Справочник.торо_ВидыОценок.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКритерииОценки(Команда)
	
	ОткрытьФорму("Справочник.торо_КритерииОценки.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
