////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетФормыВнутренний: методы, обслуживающие работу форм кадровых документов.
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Выполняет необходимые действия при создании на сервере.
// Параметры:
//		Форма - УправляемаяФорма - форма документа.
Процедура ФормаКадровогоДокументаПриСозданииНаСервере(Форма) Экспорт
	
	КадровыйУчетФормыРасширенный.ФормаКадровогоДокументаПриСозданииНаСервере(Форма);
	
КонецПроцедуры

#КонецОбласти