#Область ПрограммныйИнтерфейс

// Процедура - Сообщить пользователю. Процедура предназначена для замены системной процедуры Сообщить,
// имеет те же параметры. Замена системной процедуры Сообщить требуется в рамках подготовки к 1С:Совместимо.
//
// Параметры:
//  ТекстСообщения	 - Строка - Текст сообщения показываемого пользователю.
//  СтатусСообщения	 - СтатусСообщения - СтатусСообщения показваемого пользователю.
Процедура СообщитьПользователю(ТекстСообщения, СтатусСообщения = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

// Функция формирует строку в формате ч. мин. с. по продолжительности в секундах.
// Есть возможность задания произвольного представления для нуля.
//
// Параметры:
//		ПродолжительностьВСекундах - Число - продолжительность в секундах.
//		ПредставлениеНуля - Строка - представление нулевого значения.
//
// Возвращаемое значение:
//		Строка - строковое представление времени.
Функция СформироватьЗаголовокПоПродолжительности(ПродолжительностьВСекундах,ПредставлениеНуля = Неопределено) Экспорт
	
	Если ПродолжительностьВСекундах = null Тогда
		
		Возврат "";
	
	ИначеЕсли ПродолжительностьВСекундах = 0 Тогда
		
		Если ПредставлениеНуля = Неопределено Тогда
			Возврат НСтр("ru = 'Ввести продолжительность'");
		Иначе
			Возврат ПредставлениеНуля;
		КонецЕсли;
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 ч. %2 мин. %3 с.'"),Часы,Минуты,Секунды);
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти