#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ФО_УправлениеПерсоналом = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУправлениеПерсоналом");
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплаты,ЧтениеДанныхДляНачисленияЗарплаты,ДобавлениеИзменениеКадровогоСостоянияРасширенная,ЧтениеКадровогоСостоянияРасширенная") 
		И ФО_УправлениеПерсоналом Тогда
		// Приказ об увольнении
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.торо_ПечатьКадровыхПриказов";
		КомандаПечати.Идентификатор = "ПФ_MXL_Т8";
		КомандаПечати.Представление = НСтр("ru = 'Приказ об увольнении'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ПечатьДокументовБезПредварительногоПросмотра",
		Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПечатьРасчетаСреднегоЗаработка

// Заполняет структуру - описание документа для формирования печатной формы расчета среднего заработка.
//
// Параметры:
//   ОписаниеДокумента - структура, определяется в 
//		Обработки.ПечатьРасчетаСреднегоЗаработка.ОписаниеДокументаРасчитывающегоСреднийЗаработок.
//
Процедура ЗаполнитьОписаниеДокументаРасчитывающегоСреднийЗаработок(ОписаниеДокумента) Экспорт
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	ОписаниеДокумента.Вставить("ИмяДокумента", МетаданныеДокумента.Имя);
	ОписаниеДокумента.Вставить("СинонимДокумента", МетаданныеДокумента.Синоним);
КонецПроцедуры 

// Заполняет структуру - параметры формирования печатной формы расчета среднего заработка.
//
// Параметры:
//   ПараметрыФормирования 	- структура, определяется в Обработки.
//							ПечатьРасчетаСреднегоЗаработка.
//							ПараметрыФормированияПечатнойФормыРасчетаСреднегоЗаработка.
//	 Ссылка 				- печатаемый документ.
//
Процедура ЗаполнитьДанныеДокументаДляПечатиРасчетаСреднегоЗаработка(Ссылка, ДанныеДокумента) Экспорт
	
	РеквизитыДокумента = "Организация,Сотрудник,ПериодРасчетаСреднегоЗаработкаНачало,ПериодРасчетаСреднегоЗаработкаОкончание,Дата,Номер,ВидРасчетаКомпенсацииУдержанияОтпуска";
	
	ДанныеРеквизитовДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, РеквизитыДокумента);
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, ДанныеРеквизитовДокумента);
	
	ДанныеДокумента.Вставить("НачалоРасчетногоПериода", 	ДанныеРеквизитовДокумента.ПериодРасчетаСреднегоЗаработкаНачало);
	ДанныеДокумента.Вставить("ОкончаниеРасчетногоПериода", 	ДанныеРеквизитовДокумента.ПериодРасчетаСреднегоЗаработкаОкончание);
	ДанныеДокумента.Вставить("НомерДокумента", 				ДанныеРеквизитовДокумента.Номер);
	ДанныеДокумента.Вставить("ДатаДокумента", 				ДанныеРеквизитовДокумента.Дата);
	ДанныеДокумента.Вставить("Начисление", 					ДанныеРеквизитовДокумента.ВидРасчетаКомпенсацииУдержанияОтпуска);
	ДанныеДокумента.Вставить("МассивСотрудников",  			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеРеквизитовДокумента.Сотрудник));
	ДанныеДокумента.Вставить("ИспользоватьСреднеЧасовойЗаработок",	ИспользоватьСреднечасовойЗаработок(Ссылка));
	
КонецПроцедуры

Функция ИспользоватьСреднечасовойЗаработок(Ссылка)
	Возврат Ложь
КонецФункции 

#КонецОбласти

Функция КадровыеСобытияУвольнение(Сотрудник, ДатаУвольнения, ФизическоеЛицо = Неопределено, Позиция = Неопределено, КоличествоСтавок = Неопределено, Организация = Неопределено) Экспорт
	
	// Создаем таблицу событий
	КадровыеСобытия = Новый ТаблицаЗначений;
	КадровыеСобытия.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	КадровыеСобытия.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	КадровыеСобытия.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	КадровыеСобытия.Колонки.Добавить("ВидСобытия", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКадровыхСобытий"));
	
	КадровыеСобытия.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		
	// Заполняем таблицу
	НовоеСобытие = КадровыеСобытия.Добавить();
	НовоеСобытие.Сотрудник = Сотрудник;
	НовоеСобытие.ДатаСобытия = КонецДня(ДатаУвольнения) + 1;
	НовоеСобытие.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение;
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	КонецЕсли;
	НовоеСобытие.ФизическоеЛицо = ФизическоеЛицо;
	
	НовоеСобытие.Организация = Организация;
	
	Возврат КадровыеСобытия;
	
КонецФункции

#КонецОбласти
#КонецЕсли
