#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
# Область Печать

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Заявка на ремонт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_УчетНаработкиОборудования";
	КомандаПечати.Идентификатор = "УчетПараметровНаработки";
	КомандаПечати.Представление = НСтр("ru = 'Учет наработки оборудования'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УчетПараметровНаработки");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УчетПараметровНаработки",
		НСтр("ru = 'Учет наработки оборудования'"),
		ПечатьУчетПараметровНаработки(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_УчетНаработкиОборудования.УчетПараметровНаработки");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьУчетПараметровНаработки(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("УчетПараметровНаработки");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Шапка.Параметры.Номер 	    = МассивОбъектов[0].Номер;
	Шапка.Параметры.Дата 		= МассивОбъектов[0].Дата;
	Шапка.Параметры.Организация = МассивОбъектов[0].Организация;
	
	ТабДок.Вывести(Шапка);
	
	Ном = 1;
	Для Каждого Строка Из МассивОбъектов[0].НаработкаОбъектов Цикл
		СтрокаТаблицы.Параметры.Н = Ном;	
		СтрокаТаблицы.Параметры.Объект         = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Строка.Объект);	
		СтрокаТаблицы.Параметры.Показатель     = Строка.Показатель;	
		СтрокаТаблицы.Параметры.ЕдИзм          = Строка.Показатель.ЕдиницаИзмерения;	
		СтрокаТаблицы.Параметры.ИнвНомерОС     = Строка.Объект.ИнвентарныйНомер;	
		СтрокаТаблицы.Параметры.ТехНомерОС     = Строка.Объект.ТехНомер;	
		СтрокаТаблицы.Параметры.ДатаРаботыС    = Строка.ДатаРаботыС;	
		СтрокаТаблицы.Параметры.СтароеЗначение = Строка.СтароеЗначение;	
		СтрокаТаблицы.Параметры.Наработка      = Строка.Наработка;	
		СтрокаТаблицы.Параметры.ДатаРаботыПо   = Строка.ДатаРаботыПо;	
		СтрокаТаблицы.Параметры.НовоеЗначение  = Строка.НовоеЗначение;	
		ТабДок.Вывести(СтрокаТаблицы);
		Ном = Ном+1;
	КонецЦикла;
	Подвал.Параметры.Комментарий 		= МассивОбъектов[0].Комментарий;
	Подвал.Параметры.Ответственный		= МассивОбъектов[0].Ответственный;
	
	ТабДок.Вывести(Подвал);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
	
КонецФункции // ПечатьУчетПараметровНаработки()

#КонецОбласти

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("ИзМобильного");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли