#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФлажки(Команды.УстановитьФлажки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Флаг Из Элементы.ГруппаФлаги.ПодчиненныеЭлементы Цикл
		ЭтотОбъект[Флаг.Имя] = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Флаг Из Элементы.ГруппаФлаги.ПодчиненныеЭлементы Цикл
		ЭтотОбъект[Флаг.Имя] = Ложь;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивВозврата = Новый Структура;
	
	// Установлен хотя бы 1 флаг 
	УстановленФлаг = Ложь;
	
	Для Каждого Флаг Из Элементы.ГруппаФлаги.ПодчиненныеЭлементы Цикл
		МассивВозврата.Вставить(Флаг.Имя,ЭтотОбъект[Флаг.Имя]);
		Если Не УстановленФлаг И ЭтотОбъект[Флаг.Имя] = Истина Тогда
		
			УстановленФлаг = Истина;
		
		КонецЕсли; 
	КонецЦикла;
	
	Если УстановленФлаг Тогда
	
		Оповестить(КлючНазначенияИспользования, МассивВозврата, ЭтаФорма.ВладелецФормы);
		Закрыть();
		
	Иначе
		
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать хотя бы 1 раздел паспорта.'"), СтатусСообщения.Важное);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") <> Истина Тогда
		Элементы.ФлагХарактеристики.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти