////////////////////////////////////////////////////////////////////////////////
// торо_НастройкаПорядкаЭлементовСлужебныйВызовСервера: методы, для работы с порядком элементов.
//
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции
Функция ИзменитьПорядокЭлементов(СсылкаНаОбъект, РеквизитДопУпорядочивания, Направление, СтруктураИерархии, СтруктураСдвига) Экспорт
	
	Возврат торо_НастройкаПорядкаЭлементовСлужебный.ИзменитьПорядокЭлементов(
		СсылкаНаОбъект, РеквизитДопУпорядочивания, Направление, СтруктураИерархии, СтруктураСдвига);
	
КонецФункции

#КонецОбласти

