#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина));

	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПАРАМЕТРЫ_ПЕЧАТИ_МакетПланаРемонтовНаПериод" И Источник = ЭтаФорма Тогда
		Если Параметр = Неопределено ИЛИ НЕ Параметр.Количество() Тогда			
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать хотя бы 1 ремонт!'"), СтатусСообщения.Важное);			
		Иначе			
			СтруктураПараметровКоманды = Новый Структура("ДокППР, Параметры", Элементы.Список.ТекущиеДанные.Ссылка, Параметр);
			МассивПараметровКоманды = Новый Массив();
			МассивПараметровКоманды.Добавить(Элементы.Список.ТекущиеДанные.Ссылка);
			торо_Печать.НапечататьДокумент("Документ.торо_ГрафикРегламентныхМероприятийТОиР", "МакетПланаРемонтовНаПериод", МассивПараметровКоманды, СтруктураПараметровКоманды);
			 			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьКорректировку(Команда)
	ОткрытьФорму("Документ.торо_ГрафикРегламентныхМероприятийТОиР.Форма.ФормаДокумента", Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка")), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПланРемонтов(Команда)
	ОткрытьФорму("Документ.торо_ГрафикРегламентныхМероприятийТОиР.Форма.ФормаДокумента", Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.ПланРабот")), ЭтаФорма);
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти