#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	
	Документы.ПеремещениеТоваров.ПолучитьМассивыРеквизитов( 
		МассивВсехРеквизитов, 
		МассивРеквизитовОперации);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;

	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	Если ЗначениеЗаполнено(СкладОтправитель) И СкладОтправитель = СкладПолучатель Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Один склад не может быть как отправителем, так и получателем. Измените один из складов.'"),
				ЭтотОбъект,
				"СкладОтправитель",
				,
				Отказ);

	КонецЕсли;

	// Проверка указания характеристик.
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Характеристика");
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	КонецЕсли;
	ФОИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	Если ФОИспользоватьСерииНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												Отказ,
												МассивНепроверяемыхРеквизитов);
	КонецЕсли;	
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитовОперации,
		МассивНепроверяемыхРеквизитов);
				
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ФОИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			Движение = Движения.ТоварыНаСкладах.Добавить();
            Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
            Движение.Период         = Дата;
            Движение.Номенклатура   = ТекСтрокаТовары.Номенклатура;
            Движение.Характеристика = ТекСтрокаТовары.Характеристика;
            Движение.Склад          = СкладПолучатель;
            Движение.ВНаличии       = ТекСтрокаТовары.Количество;
			
			Если ФОИспользоватьСерии Тогда
				Движение.Серия      = ТекСтрокаТовары.Серия;
			КонецЕсли;	

			
		КонецЕсли; 
		
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			Движение = Движения.ТоварыНаСкладах.Добавить();
            Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
            Движение.Период         = Дата;
            Движение.Номенклатура   = ТекСтрокаТовары.Номенклатура;
            Движение.Характеристика = ТекСтрокаТовары.Характеристика;
            Движение.Склад          = СкладОтправитель;
            Движение.ВНаличии       = ТекСтрокаТовары.Количество;
			
			Если ФОИспользоватьСерии Тогда
				Движение.Серия      = ТекСтрокаТовары.Серия;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать();
	
			
		ТабТовары = Товары.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТабТовары.НомерСтроки,
		               |	ТабТовары.Номенклатура,
		               |	ТабТовары.Серия,
		               |	ТабТовары.Характеристика
		               |ПОМЕСТИТЬ ТабТовары
		               |ИЗ
		               |	&ТабТовары КАК ТабТовары
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабТовары.Номенклатура,
		               |	ТабТовары.Характеристика,
		               |	ТабТовары.Серия,
		               |	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
		               |	ВЫРАЗИТЬ(ТабТовары.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения
		               |ИЗ
		               |	ТабТовары КАК ТабТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &СкладОтправитель) КАК СвободныеОстаткиОстатки
		               |		ПО (СвободныеОстаткиОстатки.Номенклатура = ТабТовары.Номенклатура)
		               |			И (СвободныеОстаткиОстатки.Характеристика = ТабТовары.Характеристика)
		               |			И (&Серия)";
		
		Запрос.УстановитьПараметр("ТабТовары",        ТабТовары);
		Запрос.УстановитьПараметр("Дата",             Дата + 1);
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
		
		Если Не ФОИспользоватьСерии Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабТовары.Серия,", "");	  
			Запрос.УстановитьПараметр("Серия", Истина);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Серия", "СвободныеОстаткиОстатки.Серия = ТабТовары.Серия");
		КонецЕсли;       
		
		Выборка = Запрос.Выполнить().Выбрать();   		
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВНаличииОстаток < 0 Тогда
				
				ШаблонСообщения = "Номенклатура %Номенклатура% / %Характеристика% /%Серия%.
				|Превышен свободный остаток товара на складе %СкладОтправитель% на %Количество% %ЕдИзм%";
				
				
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Номенклатура%",     Выборка.Номенклатура);				
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Характеристика%",   Выборка.Характеристика);
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%СкладОтправитель%", СкладОтправитель);
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Количество%",       - Число(Выборка.ВналичииОстаток));
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%ЕдИзм%",            Выборка.ЕдиницаИзмерения);
				
				Если Не ФОИспользоватьСерии Тогда 				
					ШаблонСообщения = СтрЗаменить(ШаблонСообщения, " /%Серия%", "");
				Иначе 
					ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Серия%"					, Выборка.Серия); 				
				КонецЕсли;

				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ШаблонСообщения,ЭтотОбъект,"СкладОтправитель",,Отказ);
				
			КонецЕсли;
		КонецЦикла;	
        Если Не Константы.торо_ИспользоватьКонтрольОтрицательныхОстатков.Получить() Тогда
			Отказ = Ложь;
		КонецЕсли;
КонецПроцедуры
#КонецОбласти

#КонецЕсли