#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокВыбораОР") Тогда
		Для каждого Элемент Из Параметры.СписокВыбораОР Цикл
			СписокВыбора.Добавить().ОбъектРемонта = Элемент.Значение;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СписокВыбора.ОбъектРемонта
		|ПОМЕСТИТЬ СписокВыбора
		|ИЗ
		|	&СписокВыбора КАК СписокВыбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокВыбора.ОбъектРемонта,
		|	СписокВыбора.ОбъектРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель
		|ИЗ
		|	СписокВыбора КАК СписокВыбора";
		Запрос.УстановитьПараметр("СписокВыбора", СписокВыбора.Выгрузить());	
		СписокВыбора.Загрузить(Запрос.Выполнить().Выгрузить());	
	Иначе
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	ТекущиеДанные = Элементы.СписокВыбора.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ОповеститьОВыборе(Новый Структура("ОбъектРемонта,ПодразделениеИсполнитель", ТекущиеДанные.ОбъектРемонта, ТекущиеДанные.ПодразделениеИсполнитель));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

 



