#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДатаПринятия")
		И ЗначениеЗаполнено(Параметры.ДатаПринятия) Тогда
        Список.Параметры.УстановитьЗначениеПараметра("ДатаПринятия", Параметры.ДатаПринятия);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДатаПринятия", Дата(1,1,1));
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборПоСтатусам") Тогда
		торо_ОбщегоНазначения.УстановитьОтборВСпискеДокументов(Список, "Статус", Параметры.ОтборПоСтатусам, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьТехКарту(Команда)
	
	Форма = ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаЭлемента", Новый Структура("Родитель", Элементы.Список.ТекущийРодитель), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	
	Форма = ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаГруппы", Новый Структура("ЭтоГруппа, Родитель", Истина, Элементы.Список.ТекущийРодитель), ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТекДанные.ЭтоГруппа Тогда
			ПоказатьЗначение(Неопределено,ТекДанные.Ссылка);
		Иначе
			ПоказатьЗначение(Неопределено,ТекДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти