////////////////////////////////////////////////////////////////////////////////
// торо_СЛКПовторноеИспользование: методы, получения защиты СЛК с повторным использованием.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

//Функция ПолучитьМенеджерОбъектов() Экспорт
//	удалить_торо_ОбщийМодульСЛК.ПодключитьКомпоненту();
//	
//	// Создание объекта 
//	МенеджерЛицензий = Новый("AddIn.Licence.LicenceExtension20");
//	Адрес = Константы.торо_АдресСервераСЛК.Получить();
//	Порт = Константы.торо_ПортСервераСЛК.Получить();
//	// Если адрес или порт не заполнены, то будут зачитаны параметры из конфигурационных файлов.
//	Если ЗначениеЗаполнено(Адрес) и ЗначениеЗаполнено(Порт) Тогда
//		МенеджерЛицензий.ПараметрыСвязи = "host=" + Адрес + ";port=" + СтрЗаменить(Строка(Порт), " ", "");
//	КонецЕсли;	
//	
//	// Запуск
//	МенеджерЛицензий.ОкноУстановкиСвязи = Истина;
//	Если НЕ МенеджерЛицензий.Запуск(удалить_торо_ОбщийМодульСЛК.Серия(), удалить_торо_ОбщийМодульСЛК.ТолькоНаличиеКлюча()) Тогда
//		ВызватьИсключение МенеджерЛицензий.ПолучитьОписаниеОшибки();
//	КонецЕсли;
//	
//	// Создание менеджера объектов
//	Попытка
//		МенеджерОбъектов = ВнешниеОбработки.Создать(МенеджерЛицензий.МенеджерОбъектов, БезопасныйРежим());
//		МенеджерОбъектов.УстановитьМенеджерЛицензий(МенеджерЛицензий);
//	Исключение
//		ВызватьИсключение "Ошибка создания менеджера объектов СЛК: " + ОписаниеОшибки();
//	КонецПопытки;
//	
//	Возврат МенеджерОбъектов;
//	
//КонецФункции

#КонецОбласти
