#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
	ПараметрыОткрытия = Новый Структура("СписокИерархийОР,ТекСтруктураИерархии",торо_РаботаСИерархией.ПолучитьСписокИерархий(),ЭтаФорма.ТекСтруктураИерархии);
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаНастройкиВидаИерархии",ПараметрыОткрытия,ЭтаФорма,,,,
				Новый ОписаниеОповещения("НастройкаИерархииЗавершение",ЭтотОбъект,Новый Структура("ЭтаФорма",ЭтаФорма)),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура НастройкаИерархииЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
	ВыбранноеЗначение = РезультатЗакрытия;
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		ЭтаФорма.ТекСтруктураИерархии   = ВыбранноеЗначение.СтруктураИерархии;
		ЭтаФорма.РазрешенВводНовыхОР    = ВыбранноеЗначение.РазрешенВводНовыхОР;
		ЭтаФорма.ИзменяетсяДокументами  = ВыбранноеЗначение.ИзменяетсяДокументами;
		ЭтаФорма.СтроитсяАвтоматически  = ВыбранноеЗначение.СтроитсяАвтоматически;
		ЭтаФорма.ИерархическийСправочник= ВыбранноеЗначение.ИерархическийСправочник;
		ЭтаФорма.ИерархияРеквизитОР	    = ВыбранноеЗначение.РеквизитОР;
		ЭтаФорма.ИерархияТипРеквизитаОР = ВыбранноеЗначение.ТипРеквизитаОР;
		
		торо_РаботаСИерархиейКлиент.ЗаполнитьДеревоНаКлиенте(ЭтаФорма,"Дерево","Дерево");
		
		ЭтаФорма.Элементы.Дерево.Развернуть(ЭтаФорма.Дерево.ПолучитьЭлементы()[0].ПолучитьИдентификатор());
		
		Если ЭтаФорма.Элементы.Найти("ФормаСправочникторо_ОбъектыРемонтаИерархическийПросмотр") <> Неопределено
			И НЕ ЭтаФорма.Элементы.ФормаСправочникторо_ОбъектыРемонтаИерархическийПросмотр.Пометка Тогда
			торо_РаботаСИерархиейКлиент.УстановитьОтборВСписке(ЭтаФорма,Неопределено, Истина);
		КонецЕсли;
		
		торо_РаботаСИерархиейКлиент.УстановитьДоступностьСозданияНовыхОР(ЭтаФорма);
		
		СтрокиДерева = ЭтаФорма.Дерево.ПолучитьЭлементы();
		Если СтрокиДерева.Количество() > 0 Тогда
			ЭтаФорма.Элементы.Дерево.ТекущаяСтрока = СтрокиДерева[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти