#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
	Кнопка = ЭтаФорма.Элементы.ФормаСправочникторо_ОбъектыРемонтаИерархическийПросмотр;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	ТекДанные = ?(ЭтаФорма.Элементы.СписокОбъектов.ТекущиеДанные = Неопределено, ЭтаФорма.Элементы.Дерево.ТекущиеДанные, ЭтаФорма.Элементы.СписокОбъектов.ТекущиеДанные);
	
	Если НЕ ТекДанные = Неопределено Тогда
		ЭтаФорма.СписокОбъектов.Очистить();
		торо_РаботаСИерархиейКлиент.УстановитьОтборВСписке(ЭтаФорма,ТекДанные.Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти