#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекДанные.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ТекДанные = Неопределено Тогда
			ОткрытьФормуВыбранногоЗначенияТехкарты(ТекДанные)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура СоздатьТехКарту(Команда)
	
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаЭлемента", Новый Структура("Родитель", Элементы.Список.ТекущийРодитель), ЭтаФорма,,,,Неопределено, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаГруппы", Новый Структура("ЭтоГруппа, Родитель", Истина, Элементы.Список.ТекущийРодитель), ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекДанные = Неопределено Тогда
		ОткрытьФормуВыбранногоЗначенияТехкарты(ТекДанные)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте 
Процедура ОткрытьФормуВыбранногоЗначенияТехкарты(ВыбЗначение)
	
	Если ВыбЗначение.ЭтоГруппа Тогда
		ПоказатьЗначение(Неопределено,ВыбЗначение.Ссылка);
	Иначе
		ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаЭлемента", Новый Структура("Ключ", ВыбЗначение.Ссылка),ЭтаФорма,,,,Неопределено, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
