
#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР", ПараметрКоманды,"ОбследованноеОборудование", "ОбъектРемонта")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"ПланРемонтов", "ОбъектРемонтныхРабот", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"Мероприятия", "ОбъектРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"РемонтыОборудования", "ОбъектРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"ПланРемонтов", "СписокОбъектовРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"РемонтыОборудования", "ОбъектРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"РегламентныеМероприятия", "ОбъектРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"РемонтыОборудования", "ОбъектРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР", ПараметрКоманды,"СписокДефектов", "ОбъектРемонта")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_АктПриемкиОборудования") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"РемонтыОборудования", "ОбъектРемонта", "ВидРемонтныхРабот")
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		ПараметрыФормы = Новый Структура("Документ, ТабЧасть, ОР, ВР", ПараметрКоманды,"СвязанныеРемонты", "ОбъектРемонта", "ВидРемонта")	
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.торо_ФормаСпискаДокументовПоРемонту", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти